birdboat00/f9-kernel/include/platform/stm32l4/registers.h
/* STM32L4 Registers and Memory Locations */

#ifndef STM32L4_REGISTERS_H_INCLUDED
#define STM32L4_REGISTERS_H_INCLUDED

#include <stdint.h>

#define STM32L4X

/* Memory Map */
#define MEMORY_BASE (uint32_t) (0x00000000) /* Base of memory map */
#define FLASH_BASE (uint32_t) (0x08000000)  /* Flash Memory Base Address */
#define RAM_BASE (uint32_t) (0x20000000)    /* RAM Base Address */
#define ETHRAM_BASE (uint32_t) (0x2001C000) /* ETHRAM Base Address */
#define CCMRAM_BASE \
    (uint32_t) (0x10000000) /* CCMRAM Base Address - Accessible only to CPU */

/* Peripheral Map */
#define PERIPH_BASE (uint32_t) (0x40000000) /* Peripheral base address */
#define PRIV_PERIPH_BASE \
    (uint32_t) (0xED000000) /* Private peripheral base address */
#define APB1PERIPH_BASE (PERIPH_BASE)
#define APB2PERIPH_BASE (PERIPH_BASE + 0x00010000)
#define AHB1PERIPH_BASE (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE (PERIPH_BASE + 0x10000000)



/* APB1 peripherals */
#define TIM2_BASE (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE (APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE (APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE (APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE (APB1PERIPH_BASE + 0x1400)
#define TIM12_BASE (APB1PERIPH_BASE + 0x1800)
#define TIM13_BASE (APB1PERIPH_BASE + 0x1C00)
#define TIM14_BASE (APB1PERIPH_BASE + 0x2000)
#define RTC_BASE (APB1PERIPH_BASE + 0x2800)
#define WWDG_BASE (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE (APB1PERIPH_BASE + 0x3000)
#define I2S2ext_BASE (APB1PERIPH_BASE + 0x3400)
#define SPI2_BASE (APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE (APB1PERIPH_BASE + 0x3C00)
#define I2S3ext_BASE (APB1PERIPH_BASE + 0x4000)
#define USART2_BASE (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE (APB1PERIPH_BASE + 0x5800)
#define I2C3_BASE (APB1PERIPH_BASE + 0x5C00)
#define CAN1_BASE (APB1PERIPH_BASE + 0x6400)
#define CAN2_BASE (APB1PERIPH_BASE + 0x6800)
#define PWR_BASE (APB1PERIPH_BASE + 0x7000)
#define DAC_BASE (APB1PERIPH_BASE + 0x7400)

/* APB2 peripherals - STM32L4 offsets (different from F4) */
#define TIM1_BASE (APB2PERIPH_BASE + 0x2C00)
#define TIM8_BASE (APB2PERIPH_BASE + 0x3400)
#define USART1_BASE (APB2PERIPH_BASE + 0x3800)
/* No USART6 on STM32L475 */
#define ADC1_BASE (APB2PERIPH_BASE + 0x2000)
#define ADC2_BASE (APB2PERIPH_BASE + 0x2100)
#define ADC3_BASE (APB2PERIPH_BASE + 0x2200)
#define ADC_BASE (APB2PERIPH_BASE + 0x2300)
#define SDIO_BASE (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE (APB2PERIPH_BASE + 0x3000)
#define SYSCFG_BASE (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE (APB2PERIPH_BASE + 0x3C00)
#define TIM9_BASE (APB2PERIPH_BASE + 0x4000)
#define TIM10_BASE (APB2PERIPH_BASE + 0x4400)
#define TIM11_BASE (APB2PERIPH_BASE + 0x4800)

/* AHB */
#define GPIO_BASE(port) \
    (0x48000000 + (0x400 * port)) /* GPIO Port base address */
#define RCC_BASE       \
    (AHB1PERIPH_BASE + \
     0x1000) /* Reset and Clock Control base address (L4: 0x40021000) */
#define FLASH_R_BASE   \
    (AHB1PERIPH_BASE + \
     0x2000) /* Flash registers base address (L4: 0x40022000) */
#define DMA1_BASE (AHB1PERIPH_BASE + 0x6000)   /* DMA1 base address */
#define DMA2_BASE (AHB1PERIPH_BASE + 0x6400)   /* DMA2 base address */
#define USB_FS_BASE (AHB2PERIPH_BASE + 0x0000) /* USB OTG FS base address */


/* Timer 1 (TIM1) */
#define TIM1_CR1 \
    (volatile uint32_t *) (TIM1_BASE + 0x00) /* TIM1 control register 1 */
#define TIM1_CR2 \
    (volatile uint32_t *) (TIM1_BASE + 0x04) /* TIM1 control register 2 */
#define TIM1_SMCR                      \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x08) /* TIM1 slave mode control register */
#define TIM1_DIER                      \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x0C) /* TIM1 DMA/Interrupt enable register */
#define TIM1_SR \
    (volatile uint32_t *) (TIM1_BASE + 0x10) /* TIM1 status register */
#define TIM1_EGR                       \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x14) /* TIM1 event generation register */
#define TIM1_CCMR1                     \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x18) /* TIM1 capture/compare mode register 1 */
#define TIM1_CCMR2                     \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x1C) /* TIM1 capture/compare mode register 2 */
#define TIM1_CCER                      \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x20) /* TIM1 capture/compare enable register */
#define TIM1_CNT (volatile uint32_t *) (TIM1_BASE + 0x24) /* TIM1 counter */
#define TIM1_PSC (volatile uint32_t *) (TIM1_BASE + 0x28) /* TIM1 prescaler */
#define TIM1_ARR \
    (volatile uint32_t *) (TIM1_BASE + 0x2C) /* TIM1 auto-reload register */
#define TIM1_CCR1                      \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x34) /* TIM1 capture/compare register 1 */
#define TIM1_CCR2                      \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x38) /* TIM1 capture/compare register 2 */
#define TIM1_CCR3                      \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x3C) /* TIM1 capture/compare register 3 */
#define TIM1_CCR4                      \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x40) /* TIM1 capture/compare register 4 */
#define TIM1_DCR \
    (volatile uint32_t *) (TIM1_BASE + 0x48) /* TIM1 DMA control register */
#define TIM1_DMAR                      \
    (volatile uint32_t *) (TIM1_BASE + \
                           0x4C) /* TIM1 DMA address for full transfer */
#define TIM1_OR \
    (volatile uint32_t *) (TIM1_BASE + 0x50) /* TIM1 option register */

#define TIM2_CR1 \
    (volatile uint32_t *) (TIM2_BASE + 0x00) /* TIM2 control register 1 */
#define TIM2_CR2 \
    (volatile uint32_t *) (TIM2_BASE + 0x04) /* TIM2 control register 2 */
#define TIM2_SMCR                      \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x08) /* TIM2 slave mode control register */
#define TIM2_DIER                      \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x0C) /* TIM2 DMA/Interrupt enable register */
#define TIM2_SR \
    (volatile uint32_t *) (TIM2_BASE + 0x10) /* TIM2 status register */
#define TIM2_EGR                       \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x14) /* TIM2 event generation register */
#define TIM2_CCMR1                     \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x18) /* TIM2 capture/compare mode register 1 */
#define TIM2_CCMR2                     \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x1C) /* TIM2 capture/compare mode register 2 */
#define TIM2_CCER                      \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x20) /* TIM2 capture/compare enable register */
#define TIM2_CNT (volatile uint32_t *) (TIM2_BASE + 0x24) /* TIM2 counter */
#define TIM2_PSC (volatile uint32_t *) (TIM2_BASE + 0x28) /* TIM2 prescaler */
#define TIM2_ARR \
    (volatile uint32_t *) (TIM2_BASE + 0x2C) /* TIM2 auto-reload register */
#define TIM2_CCR1                      \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x34) /* TIM2 capture/compare register 1 */
#define TIM2_CCR2                      \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x38) /* TIM2 capture/compare register 2 */
#define TIM2_CCR3                      \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x3C) /* TIM2 capture/compare register 3 */
#define TIM2_CCR4                      \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x40) /* TIM2 capture/compare register 4 */
#define TIM2_DCR \
    (volatile uint32_t *) (TIM2_BASE + 0x48) /* TIM2 DMA control register */
#define TIM2_DMAR                      \
    (volatile uint32_t *) (TIM2_BASE + \
                           0x4C) /* TIM2 DMA address for full transfer */
#define TIM2_OR \
    (volatile uint32_t *) (TIM2_BASE + 0x50) /* TIM2 option register */
/* Power Control (PWR) */
#define PWR_CR \
    (volatile uint32_t *) (PWR_BASE + 0x00) /* Power Control Register */
#define PWR_CSR                                                              \
    (volatile uint32_t *) (PWR_BASE + 0x04) /* Power Control/Status Register \
                                             */

/* SPI */
#define SPI_CR1(port) \
    (volatile uint32_t *) (SPI_BASE(port) + 0x00) /* SPI control register 1 */
#define SPI_CR2(port) \
    (volatile uint32_t *) (SPI_BASE(port) + 0x04) /* SPI control register 2 */
#define SPI_SR(port) \
    (volatile uint32_t *) (SPI_BASE(port) + 0x08) /* SPI status register */
#define SPI_DR(port) \
    (volatile uint32_t *) (SPI_BASE(port) + 0x0c) /* SPI data register */
#define SPI_CRCPR(port)                     \
    (volatile uint32_t *) (SPI_BASE(port) + \
                           0x10) /* SPI CRC polynomial register */
#define SPI_RXCRCR(port) \
    (volatile uint32_t *) (SPI_BASE(port) + 0x14) /* SPI RX CRC register */
#define SPI_TXCRCR(port) \
    (volatile uint32_t *) (SPI_BASE(port) + 0x18) /* SPI TX CRC register */
#define SPI_I2SCFGR(port)                   \
    (volatile uint32_t *) (SPI_BASE(port) + \
                           0x1c) /* SPI I2C configuration register */
#define SPI_I2SPR(port)                     \
    (volatile uint32_t *) (SPI_BASE(port) + \
                           0x20) /* SPI I2C prescaler register */

/* I2C */
#define I2C_CR1(port) \
    (volatile uint32_t *) (I2C_BASE(port) + 0x00) /* I2C control register 1 */
#define I2C_CR2(port) \
    (volatile uint32_t *) (I2C_BASE(port) + 0x04) /* I2C control register 2 */
#define I2C_OAR1(port)                      \
    (volatile uint32_t *) (I2C_BASE(port) + \
                           0x08) /* I2C own address register 1 */
#define I2C_OAR2(port)                      \
    (volatile uint32_t *) (I2C_BASE(port) + \
                           0x0C) /* I2C own address register 2 */
#define I2C_DR(port) \
    (volatile uint32_t *) (I2C_BASE(port) + 0x10) /* I2C data register */
#define I2C_SR1(port) \
    (volatile uint32_t *) (I2C_BASE(port) + 0x14) /* I2C status register 1 */
#define I2C_SR2(port) \
    (volatile uint32_t *) (I2C_BASE(port) + 0x18) /* I2C status register 2 */
#define I2C_CCR(port)                       \
    (volatile uint32_t *) (I2C_BASE(port) + \
                           0x1C) /* I2C clock control register */
#define I2C_TRISE(port) \
    (volatile uint32_t *) (I2C_BASE(port) + 0x20) /* I2C TRISE register */

/* USART 1 */
#define USART1_SR \
    (volatile uint32_t *) (USART1_BASE + 0x00) /* USART1 status register */
#define USART1_DR \
    (volatile uint32_t *) (USART1_BASE + 0x04) /* USART1 data register */
#define USART1_BRR \
    (volatile uint32_t *) (USART1_BASE + 0x08) /* USART1 baud rate register */
#define USART1_CR1 \
    (volatile uint32_t *) (USART1_BASE + 0x0C) /* USART1 control register 1 */
#define USART1_CR2 \
    (volatile uint32_t *) (USART1_BASE + 0x10) /* USART1 control register 2 */
#define USART1_CR3 \
    (volatile uint32_t *) (USART1_BASE + 0x14) /* USART1 control register 3 */
#define USART1_GTPR                      \
    (volatile uint32_t *) (USART1_BASE + \
                           0x18) /* USART1 gaurd time and prescale register */

/* GPIO Port (GPIO) */
#define GPIO_MODER(port) \
    (volatile uint32_t *) (GPIO_BASE(port) + 0x00) /* Port mode register */
#define GPIO_OTYPER(port)                    \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x04) /* Port output type register */
#define GPIO_OSPEEDR(port)                   \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x08) /* Port output speed register */
#define GPIO_PUPDR(port)                     \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x0C) /* Port pull up/down register */
#define GPIO_IDR(port)                       \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x10) /* Port input data register */
#define GPIO_ODR(port)                       \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x14) /* Port output data register */
#define GPIO_BSRR(port)                      \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x18) /* Port bit set/reset register */
#define GPIO_LCKR(port)                      \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x1C) /* Port configuration lock register */
#define GPIO_AFRL(port)                      \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x20) /* Port alternate function low register */
#define GPIO_AFRH(port)                      \
    (volatile uint32_t *) (GPIO_BASE(port) + \
                           0x24) /* Port alternate function high register */

/* Reset and Clock Control (RCC) */
#define RCC_CR \
    (volatile uint32_t *) (RCC_BASE + 0x00) /* Clock Control Register */
#define RCC_PLLCFGR \
    (volatile uint32_t *) (RCC_BASE + 0x04) /* PLL Configuration Register */
#define RCC_CFGR \
    (volatile uint32_t *) (RCC_BASE + 0x08) /* Clock Configuration Register */
#define RCC_CIR \
    (volatile uint32_t *) (RCC_BASE + 0x0C) /* Clock Interrupt Register */
#define RCC_AHB1RSTR \
    (volatile uint32_t *) (RCC_BASE + 0x10) /* AHB1 reset Register */
#define RCC_APB1RSTR \
    (volatile uint32_t *) (RCC_BASE + 0x20) /* APB1 reset Register */
#define RCC_APB2RSTR \
    (volatile uint32_t *) (RCC_BASE + 0x24) /* APB2 reset Register */
/* STM32L4 RCC enable registers (different offsets from F4) */
#define RCC_AHB1ENR \
    (volatile uint32_t *) (RCC_BASE + 0x48) /* AHB1 Enable Register */
#define RCC_AHB2ENR \
    (volatile uint32_t *) (RCC_BASE + 0x4C) /* AHB2 Enable Register */
#define RCC_APB1ENR                   \
    (volatile uint32_t *) (RCC_BASE + \
                           0x58) /* APB1 Peripheral Clock Enable Register 1 */
#define RCC_APB2ENR                   \
    (volatile uint32_t *) (RCC_BASE + \
                           0x60) /* APB2 Peripheral Clock Enable Register */
#define RCC_BDCR                      \
    (volatile uint32_t *) (RCC_BASE + \
                           0x70) /* RCC Backup Domain Control Register */
#define RCC_CSR                       \
    (volatile uint32_t *) (RCC_BASE + \
                           0x74) /* RCC Clock Control & Status Register */
#define RCC_PLLSAICFGR                \
    (volatile uint32_t *) (RCC_BASE + \
                           0x88) /* RCC PLLSAI Configuration register */
#define RCC_DCKCFGR                                                 \
    (volatile uint32_t *) (RCC_BASE + 0x8C) /* RCC Dedicated Clocks \
                                               Configuration register */

/* SYSCFG */
#define SYSCFG_MEMRMP \
    (volatile uint32_t *) (SYSCFG_BASE + 0x0) /* Memory remap register */
#define SYSCFG_PMC                       \
    (volatile uint32_t *) (SYSCFG_BASE + \
                           0x4) /* Peripheral mode config register */
#define SYSCFG_EXTICR1                   \
    (volatile uint32_t *) (SYSCFG_BASE + \
                           0x8) /* External INT config register1 */
#define SYSCFG_EXTICR2                   \
    (volatile uint32_t *) (SYSCFG_BASE + \
                           0xc) /* External INT config register2 */
#define SYSCFG_EXTICR3                   \
    (volatile uint32_t *) (SYSCFG_BASE + \
                           0x10) /* External INT config register3 */
#define SYSCFG_EXTICR4                   \
    (volatile uint32_t *) (SYSCFG_BASE + \
                           0x14) /* External INT config register4 */
#define SYSCFG_CMPCR                     \
    (volatile uint32_t *) (SYSCFG_BASE + \
                           0x20) /* Compensation cell control register*/



/* APB1 RCC ENR */
#define RCC_TIM2_APBENR RCC_APB1ENR
#define RCC_TIM3_APBENR RCC_APB1ENR
#define RCC_TIM4_APBENR RCC_APB1ENR
#define RCC_TIM5_APBENR RCC_APB1ENR
#define RCC_TIM6_APBENR RCC_APB1ENR
#define RCC_TIM7_APBENR RCC_APB1ENR
#define RCC_TIM12_APBENR RCC_APB1ENR
#define RCC_TIM13_APBENR RCC_APB1ENR
#define RCC_TIM14_APBENR RCC_APB1ENR
#define RCC_WWDG_APBENR RCC_APB1ENR
#define RCC_SPI2_APBENR RCC_APB1ENR
#define RCC_SPI3_APBENR RCC_APB1ENR
#define RCC_USART2_APBENR RCC_APB1ENR
#define RCC_USART3_APBENR RCC_APB1ENR
#define RCC_UART4_APBENR RCC_APB1ENR
#define RCC_UART5_APBENR RCC_APB1ENR
#define RCC_I2C1_APBENR RCC_APB1ENR
#define RCC_I2C2_APBENR RCC_APB1ENR
#define RCC_I2C3_APBENR RCC_APB1ENR
#define RCC_CAN1_APBENR RCC_APB1ENR
#define RCC_CAN2_APBENR RCC_APB1ENR
#define RCC_PWR_APBENR RCC_APB1ENR
#define RCC_DAC_APBENR RCC_APB1ENR

/* APB2 RCC ENR */
#define RCC_TIM1_APBENR RCC_APB2ENR
#define RCC_TIM8_APBENR RCC_APB2ENR
#define RCC_USART1_APBENR RCC_APB2ENR
#define RCC_USART6_APBENR RCC_APB2ENR
#define RCC_ADC1_APBENR RCC_APB2ENR
#define RCC_ADC2_APBENR RCC_APB2ENR
#define RCC_ADC3_APBENR RCC_APB2ENR
#define RCC_SDIO_APBENR RCC_APB2ENR
#define RCC_SPI1_APBENR RCC_APB2ENR
#define RCC_SYSCFG_APBENR RCC_APB2ENR
#define RCC_TIM9_APBENR RCC_APB2ENR
#define RCC_TIM10_APBENR RCC_APB2ENR
#define RCC_TIM11_APBENR RCC_APB2ENR

