birdboat00/f9-kernel/include/platform/stm32l4/registers.h
/* Flash Registers (FLASH) */
#define FLASH_ACR                         \
    (volatile uint32_t *) (FLASH_R_BASE + \
                           0x00) /* Flash Access Control Register */

/* Direct Memory Access 1 (DMA) */
#define DMA1_LISR                      \
    (volatile uint32_t *) (DMA1_BASE + \
                           0x00) /* DMA1 low interrupt status register */
#define DMA1_HISR                      \
    (volatile uint32_t *) (DMA1_BASE + \
                           0x04) /* DMA1 high interrupt status register */
#define DMA1_LIFCR                     \
    (volatile uint32_t *) (DMA1_BASE + \
                           0x08) /* DMA1 low interrupt flag clear register */
#define DMA1_HIFCR                     \
    (volatile uint32_t *) (DMA1_BASE + \
                           0x0C) /* DMA1 high interrupt flag clear register */
/* Stream n */
#define DMA1_CR_S(n)                          \
    (volatile uint32_t *) (DMA1_BASE + 0x10 + \
                           (0x18 *            \
                            n)) /* DMA1 stream n configuration register */
#define DMA1_NDTR_S(n)                        \
    (volatile uint32_t *) (DMA1_BASE + 0x14 + \
                           (0x18 *            \
                            n)) /* DMA1 stream n number of data register */
#define DMA1_PAR_S(n)           \
    (volatile uint32_t          \
         *) (DMA1_BASE + 0x18 + \
             (0x18 * n)) /* DMA1 stream n peripheral address register */
#define DMA1_M0AR_S(n)                        \
    (volatile uint32_t *) (DMA1_BASE + 0x1C + \
                           (0x18 *            \
                            n)) /* DMA1 stream n memory 0 address register */
#define DMA1_M1AR_S(n)                        \
    (volatile uint32_t *) (DMA1_BASE + 0x20 + \
                           (0x18 *            \
                            n)) /* DMA1 stream n memory 1 address register */
#define DMA1_FCR_S(n)                         \
    (volatile uint32_t *) (DMA1_BASE + 0x24 + \
                           (0x18 *            \
                            n)) /* DMA1 stream n FIFO control register */

/* Direct Memory Access 2 (DMA) */
#define DMA2_LISR                      \
    (volatile uint32_t *) (DMA2_BASE + \
                           0x00) /* DMA2 low interrupt status register */
#define DMA2_HISR                      \
    (volatile uint32_t *) (DMA2_BASE + \
                           0x04) /* DMA2 high interrupt status register */
#define DMA2_LIFCR                     \
    (volatile uint32_t *) (DMA2_BASE + \
                           0x08) /* DMA2 low interrupt flag clear register */
#define DMA2_HIFCR                     \
    (volatile uint32_t *) (DMA2_BASE + \
                           0x0C) /* DMA2 high interrupt flag clear register */
/* Stream n */
#define DMA2_CR_S(n)                          \
    (volatile uint32_t *) (DMA2_BASE + 0x10 + \
                           (0x18 *            \
                            n)) /* DMA2 stream n configuration register */
#define DMA2_NDTR_S(n)                        \
    (volatile uint32_t *) (DMA2_BASE + 0x14 + \
                           (0x18 *            \
                            n)) /* DMA2 stream n number of data register */
#define DMA2_PAR_S(n)           \
    (volatile uint32_t          \
         *) (DMA2_BASE + 0x18 + \
             (0x18 * n)) /* DMA2 stream n peripheral address register */
#define DMA2_M0AR_S(n)                        \
    (volatile uint32_t *) (DMA2_BASE + 0x1C + \
                           (0x18 *            \
                            n)) /* DMA2 stream n memory 0 address register */
#define DMA2_M1AR_S(n)                        \
    (volatile uint32_t *) (DMA2_BASE + 0x20 + \
                           (0x18 *            \
                            n)) /* DMA2 stream n memory 1 address register */
#define DMA2_FCR_S(n)                         \
    (volatile uint32_t *) (DMA2_BASE + 0x24 + \
                           (0x18 *            \
                            n)) /* DMA2 stream n FIFO control register */

/* USB OTG Full-Speed */
/* Global Control and Status Registers */
#define USB_FS_GOTGCTL                   \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0000) /* USB control and status register */
#define USB_FS_GOTGINT \
    (volatile uint32_t *) (USB_FS_BASE + 0x0004) /* USB interrupt register */
#define USB_FS_GAHBCFG                   \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0008) /* USB AHB configuration register */
#define USB_FS_GUSBCFG                   \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x000C) /* USB USB configuration register */
#define USB_FS_GRSTCTL                   \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0010) /* USB reset control register */
#define USB_FS_GINTSTS                   \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0014) /* USB core interrupt register */
#define USB_FS_GINTMSK                   \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0018) /* USB interrupt mask register */
#define USB_FS_GRXSTSR                                                       \
    (volatile uint32_t *) (USB_FS_BASE + 0x001C) /* USB receive status debug \
                                                    read register */
#define USB_FS_GRXSTSP                                                       \
    (volatile uint32_t *) (USB_FS_BASE + 0x0020) /* USB receive status debug \
                                                    read and pop register */
#define USB_FS_GRXFSIZ                   \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0024) /* USB receive FIFO size register */
#define USB_FS_DIEPTXF0                                                     \
    (volatile uint32_t *) (USB_FS_BASE + 0x0028) /* USB endpoint 0 transmit \
                                                    FIFO size register */
#define USB_FS_HNPTXFSIZ   \
    (volatile uint32_t     \
         *) (USB_FS_BASE + \
             0x0028) /* USB host non-periodic transmit FIFO size register */
#define USB_FS_HNPTXSTS                                              \
    (volatile uint32_t *) (USB_FS_BASE +                             \
                           0x002C) /* USB host non-periodic transmit \
                                      FIFO/queue status register */
#define USB_FS_GCCFG                                                 \
    (volatile uint32_t *) (USB_FS_BASE + 0x0038) /* USB general core \
                                                    configuration register */
#define USB_FS_CID \
    (volatile uint32_t *) (USB_FS_BASE + 0x003C) /* USB core ID register */
#define USB_FS_HPTXFSIZ                                                        \
    (volatile uint32_t *) (USB_FS_BASE + 0x0100) /* USB host periodic transmit \
                                                    FIFO size register */
#define USB_FS_DIEPTXF1                                                    \
    (volatile uint32_t *) (USB_FS_BASE +                                   \
                           0x0104) /* USB device IN endpoint transmit FIFO \
                                      size register 1 */
#define USB_FS_DIEPTXF2                                                    \
    (volatile uint32_t *) (USB_FS_BASE +                                   \
                           0x0108) /* USB device IN endpoint transmit FIFO \
                                      size register 2 */
#define USB_FS_DIEPTXF3                                                    \
    (volatile uint32_t *) (USB_FS_BASE +                                   \
                           0x010C) /* USB device IN endpoint transmit FIFO \
                                      size register 3 */

/* Host-mode Registers */
/* ... */

/* Device-mode Registers */
#define USB_FS_DCFG                      \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0800) /* USB device configuration register */
#define USB_FS_DCTL                      \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0804) /* USB device control register */
#define USB_FS_DSTS                      \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0808) /* USB device status register */
#define USB_FS_DSTS                      \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x0808) /* USB device status register */
#define USB_FS_DIEPMSK                                                        \
    (volatile uint32_t *) (USB_FS_BASE +                                      \
                           0x0810) /* USB device IN endpoint common interrupt \
                                      mask register */
#define USB_FS_DOEPMSK                                                         \
    (volatile uint32_t *) (USB_FS_BASE +                                       \
                           0x0814) /* USB device OUT endpoint common interrupt \
                                      mask register */
#define USB_FS_DAINT                                                         \
    (volatile uint32_t *) (USB_FS_BASE + 0x0818) /* USB device all endpoints \
                                                    interrupt register */
#define USB_FS_DAINTMSK                                                      \
    (volatile uint32_t *) (USB_FS_BASE + 0x081C) /* USB device all endpoints \
                                                    interrupt mask register */
#define USB_FS_DVBUSDIS                                                       \
    (volatile uint32_t *) (USB_FS_BASE + 0x0828) /* USB device VBUS discharge \
                                                    time register */
#define USB_FS_DVBUSPULSE                \
    (volatile uint32_t *) (USB_FS_BASE + \
                           0x082C) /* USB device VBUS pulse time register */
#define USB_FS_DIEPEMPMSK                                               \
    (volatile uint32_t *) (USB_FS_BASE +                                \
                           0x0834) /* USB device IN endpoint FIFO empty \
                                      interrupt mask register */
#define USB_FS_DIEPCTL0                                                      \
    (volatile uint32_t *) (USB_FS_BASE + 0x0900) /* USB device IN endpoint 0 \
                                                    control register */
#define USB_FS_DIEPCTL(n)           \
    (volatile uint32_t              \
         *) (USB_FS_BASE + 0x0900 + \
             n * 0x20) /* USB device endpoint n control register */
#define USB_FS_DIEPINT(n)           \
    (volatile uint32_t              \
         *) (USB_FS_BASE + 0x0908 + \
             n * 0x20) /* USB device endpoint n interrupt register */
#define USB_FS_DIEPTSIZ0                                                     \
    (volatile uint32_t *) (USB_FS_BASE + 0x0910) /* USB device IN endpoint 0 \
                                                    transfer size register */
#define USB_FS_DIEPTSIZ(n)          \
    (volatile uint32_t              \
         *) (USB_FS_BASE + 0x0910 + \
             n * 0x20) /* USB device OUT endpoint n transfer size register */
#define USB_FS_DTXFSTS(n)           \
    (volatile uint32_t              \
         *) (USB_FS_BASE + 0x0918 + \
             n * 0x20) /* USB device IN endpoint n FIFO status register */
#define USB_FS_DOEPCTL0                                                       \
    (volatile uint32_t *) (USB_FS_BASE + 0x0B00) /* USB device OUT endpoint 0 \
                                                    control register */
#define USB_FS_DOEPCTL(n)           \
    (volatile uint32_t              \
         *) (USB_FS_BASE + 0x0B00 + \
             n * 0x20) /* USB device endpoint n control register */
#define USB_FS_DOEPINT(n)           \
    (volatile uint32_t              \
         *) (USB_FS_BASE + 0x0B08 + \
             n * 0x20) /* USB device endpoint 1 interrupt register */
#define USB_FS_DOEPTSIZ0                                                      \
    (volatile uint32_t *) (USB_FS_BASE + 0x0B10) /* USB device OUT endpoint 0 \
                                                    transfer size register */
#define USB_FS_DOEPTSIZ(n)          \
    (volatile uint32_t              \
         *) (USB_FS_BASE + 0x0B10 + \
             n * 0x20) /* USB device OUT endpoint n transfer size register */

/* Data FIFO Registers */
#define USB_FS_DFIFO_EP(n)          \
    (volatile uint32_t              \
         *) (USB_FS_BASE + 0x1000 + \
             n * 0x1000) /* USB endpoint n data FIFO base address */

/* Power and Clock Gating Registers */
#define USB_FS_PCGCR                                                           \
    (volatile uint32_t *) (USB_FS_BASE + 0x0E00) /* USB power and clock gating \
                                                    control register */


/**********************************************************************************************************************************************/

/* Bit Masks - See RM0090 Reference Manual for STM32F4 for details */
#define PWR_CR_VOS                                                          \
    (uint16_t) (1 << 9) /* Regulator voltage scaling output selection - L4: \
                           VOS[1:0] bits 10:9, use 01b for Range 1 (80MHz) */

#define MSI_VALUE (uint32_t) (4000000)  /* MSI default value in Hz (Range 6) */
#define HSI_VALUE (uint32_t) (16000000) /* HSI value in Hz */
#define HSE_VALUE (uint32_t) (1 << 27)  /* HSE value in Hz */

#define RCC_CR_HSION (uint32_t) (1 << 0)        /* HSI clock enable */
#define RCC_CR_HSIRDY (uint32_t) (1 << 1)       /* HSI ready */
#define RCC_CR_HSITRIM_M (uint32_t) (0x1F << 3) /* HSI trimming mask */
#define RCC_CR_HSITRIM(n) (uint32_t) (n << 3)   /* HSI trimming */
#define RCC_CR_HSICAL_M (uint32_t) (0xFF << 8)  /* HSI calibration mask */
#define RCC_CR_HSEON (uint32_t) (1 << 16)       /* HSE clock enable */
#define RCC_CR_HSERDY (uint32_t) (1 << 17)      /* HSE ready */
#define RCC_CR_HSEBYP (uint32_t) (1 << 18)      /* HSE bypass */
#define RCC_CR_CSSON (uint32_t) (1 << 19)     /* Clock security system enable */
#define RCC_CR_PLLON (uint32_t) (1 << 24)     /* Main PLL enable */
#define RCC_CR_PLLRDY (uint32_t) (1 << 25)    /* Main PLL clock ready */
#define RCC_CR_PLLI2SON (uint32_t) (1 << 26)  /* PLLI2S enable */
#define RCC_CR_PLLI2SRDY (uint32_t) (1 << 27) /* PLLI2S clock ready */

#define RCC_PLLCFGR_RESET \
    (uint32_t) (0x24003010) /* PLLCFGR register reset value */
/* STM32L4 PLLSRC is bits [1:0]: 01=MSI, 10=HSI16, 11=HSE */
#define RCC_PLLCFGR_PLLSRC_MSI (uint32_t) (1) /* MSI selected as PLL input */
#define RCC_PLLCFGR_PLLSRC_HSI                                               \
    (uint32_t) (2)                            /* HSI16 selected as PLL input \
                                               */
#define RCC_PLLCFGR_PLLSRC_HSE (uint32_t) (3) /* HSE selected as PLL input */
#define RCC_PLLCFGR_PLLM (uint32_t) (0x003F)
#define RCC_PLLCFGR_PLLN (uint32_t) (0x7FC0)
#define RCC_PLLCFGR_PLLP (uint32_t) (0x00030000)
#define RCC_PLLCFGR_PLLR (uint32_t) (0x06000000) /* L4: PLLR bits [26:25] */

#define RCC_CFGR_SW_M (uint32_t) (3 << 0) /* System clock switch mask */
#define RCC_CFGR_SW_HSI                                                       \
    (uint32_t) (0 << 0) /* System clock switch - HSI selected as system clock \
                         */
#define RCC_CFGR_SW_HSE                                                       \
    (uint32_t) (1 << 0) /* System clock switch - HSE selected as system clock \
                         */
#define RCC_CFGR_SW_PLL                                                       \
    (uint32_t) (2 << 0) /* System clock switch - PLL selected as system clock \
                         */
#define RCC_CFGR_SWS_M                                     \
    (uint32_t) (3 << 2) /* System clock switch status mask \
                         */
#define RCC_CFGR_SWS_HSI                                                   \
    (uint32_t) (0 << 2) /* System clock switch status - HSI used as system \
                           clock */
#define RCC_CFGR_SWS_HSE                                                   \
    (uint32_t) (1 << 2) /* System clock switch status - HSE used as system \
                           clock */
#define RCC_CFGR_SWS_PLL                                                   \
    (uint32_t) (2 << 2) /* System clock switch status - PLL used as system \
                           clock */
#define RCC_CFGR_HPRE_M (uint32_t) (0xF << 4) /* AHB prescaler mask */
#define RCC_CFGR_HPRE_DIV1 \
    (uint32_t) (0x0 << 4) /* AHB prescaler - SYSCLK not divided */
#define RCC_CFGR_HPRE_DIV2                            \
    (uint32_t) (0x8 << 4) /* AHB prescaler - SYSCLK/2 \
                           */
#define RCC_CFGR_HPRE_DIV4                            \
    (uint32_t) (0x9 << 4) /* AHB prescaler - SYSCLK/4 \
                           */
#define RCC_CFGR_HPRE_DIV8                            \
    (uint32_t) (0xA << 4) /* AHB prescaler - SYSCLK/8 \
                           */
#define RCC_CFGR_HPRE_DIV16 \
    (uint32_t) (0xB << 4) /* AHB prescaler - SYSCLK/16 */
#define RCC_CFGR_HPRE_DIV64 \
    (uint32_t) (0xC << 4) /* AHB prescaler - SYSCLK/64 */
#define RCC_CFGR_HPRE_DIV128 \
    (uint32_t) (0xD << 4) /* AHB prescaler - SYSCLK/128 */
#define RCC_CFGR_HPRE_DIV256 \
    (uint32_t) (0xE << 4) /* AHB prescaler - SYSCLK/256 */
#define RCC_CFGR_HPRE_DIV512 \
    (uint32_t) (0xF << 4) /* AHB prescaler - SYSCLK/512 */
#define RCC_CFGR_PPRE1_M                                 \
    (uint32_t) (7 << 10) /* APB low speed prescaler mask \
                          */
#define RCC_CFGR_PPRE1_DIV1 \
    (uint32_t) (0 << 10) /* APB low speed prescaler - HCLK/1 */
#define RCC_CFGR_PPRE1_DIV2 \
    (uint32_t) (4 << 10) /* APB low speed prescaler - HCLK/2 */
#define RCC_CFGR_PPRE1_DIV4 \
    (uint32_t) (5 << 10) /* APB low speed prescaler - HCLK/4 */
#define RCC_CFGR_PPRE1_DIV8 \
    (uint32_t) (6 << 10) /* APB low speed prescaler - HCLK/8 */
#define RCC_CFGR_PPRE1_DIV16 \
    (uint32_t) (7 << 10) /* APB low speed prescaler - HCLK/16 */
#define RCC_CFGR_PPRE2_M \
    (uint32_t) (7 << 13) /* APB high speec prescaler mask */
#define RCC_CFGR_PPRE2_DIV1 \
    (uint32_t) (0 << 13) /* APB high speed prescaler - HCLK/1 */
#define RCC_CFGR_PPRE2_DIV2 \
    (uint32_t) (4 << 13) /* APB high speed prescaler - HCLK/2 */
#define RCC_CFGR_PPRE2_DIV4 \
    (uint32_t) (5 << 13) /* APB high speed prescaler - HCLK/4 */
#define RCC_CFGR_PPRE2_DIV8 \
    (uint32_t) (6 << 13) /* APB high speed prescaler - HCLK/8 */
#define RCC_CFGR_PPRE2_DIV16 \
    (uint32_t) (7 << 13) /* APB high speed prescaler - HCLK/16 */
#define RCC_CFGR_RTCPRE_M \
    (uint32_t) (0x1F << 16) /* HSE division factor for RTC clock mask */
#define RCC_CFGR_RTCPRE(n) \
    (uint32_t) (n << 16) /* HSE division factor for RTC clock */

#define RCC_AHB1RSTR_GPIOARST (uint32_t) (1 << 0)   /* GPIOA reset */
#define RCC_AHB1RSTR_GPIOBRST (uint32_t) (1 << 1)   /* GPIOB reset */
#define RCC_AHB1RSTR_GPIOCRST (uint32_t) (1 << 2)   /* GPIOC reset */
#define RCC_AHB1RSTR_GPIODRST (uint32_t) (1 << 3)   /* GPIOD reset */
#define RCC_AHB1RSTR_GPIOERST (uint32_t) (1 << 4)   /* GPIOE reset */
#define RCC_AHB1RSTR_GPIOFRST (uint32_t) (1 << 5)   /* GPIOF reset */
#define RCC_AHB1RSTR_GPIOGRST (uint32_t) (1 << 6)   /* GPIOG reset */
#define RCC_AHB1RSTR_GPIOHRST (uint32_t) (1 << 7)   /* GPIOH reset */
#define RCC_AHB1RSTR_GPIOIRST (uint32_t) (1 << 8)   /* GPIOI reset */
#define RCC_AHB1RSTR_CRCRST (uint32_t) (1 << 12)    /* CRC reset */
#define RCC_AHB1RSTR_DMA1RST (uint32_t) (1 << 21)   /* DMA1 reset */
#define RCC_AHB1RSTR_DMA2RST (uint32_t) (1 << 22)   /* DMA2 reset */
#define RCC_AHB1RSTR_ETHMACRST (uint32_t) (1 << 25) /* Ethernet MAC reset */
#define RCC_AHB1RSTR_OTGHSRST (uint32_t) (1 << 29)  /* USB OTG HS reset */

#define RCC_AHB2RSTR_DCMIRST (uint32_t) (1 << 0) /* Camera interface reset */
#define RCC_AHB2RSTR_CRYPRST (uint32_t) (1 << 4) /* Cyrpto modules reset */
#define RCC_AHB2RSTR_HASHRST (uint32_t) (1 << 5) /* Hash modules reset */
#define RCC_AHB2RSTR_RNGRST \
    (uint32_t) (1 << 6) /* Random number generator reset */
#define RCC_AHB2RSTR_OTGFSRST (uint32_t) (1 << 7) /* USB OTG FS reset */

