birdboat00/f9-kernel/include/platform/stm32l4/registers.h
#define RCC_AHB3RSTR_FSMCRST \
    (uint32_t) (1 << 0) /* Flexible static memeory controller reset */

#define RCC_APB1RSTR_TIM2RST (uint32_t) (1 << 0)    /* TIM2 reset */
#define RCC_APB1RSTR_TIM3RST (uint32_t) (1 << 1)    /* TIM3 reset */
#define RCC_APB1RSTR_TIM4RST (uint32_t) (1 << 2)    /* TIM4 reset */
#define RCC_APB1RSTR_TIM5RST (uint32_t) (1 << 3)    /* TIM5 reset */
#define RCC_APB1RSTR_TIM6RST (uint32_t) (1 << 4)    /* TIM6 reset */
#define RCC_APB1RSTR_TIM7RST (uint32_t) (1 << 5)    /* TIM7 reset */
#define RCC_APB1RSTR_TIM12RST (uint32_t) (1 << 6)   /* TIM12 reset */
#define RCC_APB1RSTR_TIM13RST (uint32_t) (1 << 7)   /* TIM13 reset */
#define RCC_APB1RSTR_TIM14RST (uint32_t) (1 << 8)   /* TIM14 reset */
#define RCC_APB1RSTR_WWDGRST (uint32_t) (1 << 11)   /* Window watchdog reset */
#define RCC_APB1RSTR_SPI2RST (uint32_t) (1 << 14)   /* SPI2 reset */
#define RCC_APB1RSTR_SPI3RST (uint32_t) (1 << 15)   /* SPI3 reset */
#define RCC_APB1RSTR_USART2RST (uint32_t) (1 << 17) /* USART2 reset */
#define RCC_APB1RSTR_USART3RST (uint32_t) (1 << 18) /* USART3 reset */
#define RCC_APB1RSTR_USART4RST (uint32_t) (1 << 19) /* USART4 reset */
#define RCC_APB1RSTR_USART5RST (uint32_t) (1 << 20) /* USART5 reset */
#define RCC_APB1RSTR_I2C1RST (uint32_t) (1 << 21)   /* I2C1 reset */
#define RCC_APB1RSTR_I2C2RST (uint32_t) (1 << 22)   /* I2C2 reset */
#define RCC_APB1RSTR_I2C3RST (uint32_t) (1 << 23)   /* I2C3 reset */
#define RCC_APB1RSTR_CAN1RST (uint32_t) (1 << 25)   /* CAN1 reset */
#define RCC_APB1RSTR_CAN2RST (uint32_t) (1 << 26)   /* CAN2 reset */
#define RCC_APB1RSTR_PWRRST (uint32_t) (1 << 28)    /* Power interface reset */
#define RCC_APB1RSTR_DACRST (uint32_t) (1 << 29)    /* DAC reset */

#define RCC_APB2RSTR_TIM1RST (uint32_t) (1 << 0)    /* TIM1 reset */
#define RCC_APB2RSTR_TIM8RST (uint32_t) (1 << 1)    /* TIM8 reset */
#define RCC_APB2RSTR_USART1RST (uint32_t) (1 << 14) /* USART1 reset */
#define RCC_APB2RSTR_USART6RST (uint32_t) (1 << 5)  /* USART6 reset */
#define RCC_APB2RSTR_ADCRST (uint32_t) (1 << 8)     /* ADC1 reset */
#define RCC_APB2RSTR_SDIORST (uint32_t) (1 << 11)   /* SDIO reset */
#define RCC_APB2RSTR_SPI1RST (uint32_t) (1 << 12)   /* SPI1 reset */
#define RCC_APB2RSTR_SYSCFGRST \
    (uint32_t) (1 << 14) /* System configuration controller reset */
#define RCC_APB2RSTR_TIM9RST (uint32_t) (1 << 16)  /* TIM9 reset */
#define RCC_APB2RSTR_TIM10RST (uint32_t) (1 << 17) /* TIM10 reset */
#define RCC_APB2RSTR_TIM11RST (uint32_t) (1 << 18) /* TIM11 reset */

#define RCC_AHB1ENR_GPIOAEN (uint32_t) (1 << 0) /* GPIOA clock enable */
#define RCC_AHB1ENR_GPIOBEN (uint32_t) (1 << 1) /* GPIOB clock enable */
#define RCC_AHB1ENR_GPIOCEN (uint32_t) (1 << 2) /* GPIOC clock enable */
#define RCC_AHB1ENR_GPIODEN (uint32_t) (1 << 3) /* GPIOD clock enable */
#define RCC_AHB1ENR_GPIOEEN (uint32_t) (1 << 4) /* GPIOE clock enable */
#define RCC_AHB1ENR_GPIOFEN (uint32_t) (1 << 5) /* GPIOF clock enable */
#define RCC_AHB1ENR_GPIOGEN (uint32_t) (1 << 6) /* GPIOG clock enable */
#define RCC_AHB1ENR_GPIOHEN (uint32_t) (1 << 7) /* GPIOH clock enable */
#define RCC_AHB1ENR_GPIOIEN (uint32_t) (1 << 8) /* GPIOI clock enable */
#define RCC_AHB1ENR_CRCEN (uint32_t) (1 << 12)  /* CRC clock enable */
#define RCC_AHB1ENR_BKPSRAMEN \
    (uint32_t) (1 << 18) /* Backup SRAM clock enable */
#define RCC_AHB1ENR_CCMDATARAMEN \
    (uint32_t) (1 << 20)                        /* CCM data RAM clock enable */
#define RCC_AHB1ENR_DMA1EN (uint32_t) (1 << 21) /* DMA1 clock enable */
#define RCC_AHB1ENR_DMA2EN (uint32_t) (1 << 22) /* DMA2 clock enable */
#define RCC_AHB1ENR_ETHMACEN \
    (uint32_t) (1 << 25) /* Ethernet MAC clock enable */
#define RCC_AHB1ENR_ETHMACTXEN \
    (uint32_t) (1 << 26) /* Ethernet MAC TX clock enable */
#define RCC_AHB1ENR_ETHMACRXEN \
    (uint32_t) (1 << 27) /* Ethernet MAC RX clock enable */
#define RCC_AHB1ENR_ETHMACPTPEN \
    (uint32_t) (1 << 28) /* Ethernet MAC PTP clock enable */
#define RCC_AHB1ENR_OTGHSEN (uint32_t) (1 << 29) /* USB OTG HS clock enable */
#define RCC_AHB1ENR_OTGHSULPIEN \
    (uint32_t) (1 << 30) /* USB OTG HSULPI clock enable */

#define RCC_AHB2ENR_DCMIEN \
    (uint32_t) (1 << 0) /* Camera interface clock enable */
#define RCC_AHB2ENR_CRYPEN                                                    \
    (uint32_t) (1 << 4)                        /* Cyrpto modules clock enable \
                                                */
#define RCC_AHB2ENR_HASHEN (uint32_t) (1 << 5) /* Hash modules clock enable */
#define RCC_AHB2ENR_RNGEN \
    (uint32_t) (1 << 6) /* Random number generator clock enable */
#define RCC_AHB2ENR_OTGFSEN (uint32_t) (1 << 7) /* USB OTG FS clock enable */

#define RCC_AHB3ENR_FSMCEN \
    (uint32_t) (1 << 0) /* Flexible static memeory controller clock enable */

#define RCC_APB1ENR_TIM2EN (uint32_t) (1 << 0)  /* TIM2 clock enable */
#define RCC_APB1ENR_TIM3EN (uint32_t) (1 << 1)  /* TIM3 clock enable */
#define RCC_APB1ENR_TIM4EN (uint32_t) (1 << 2)  /* TIM4 clock enable */
#define RCC_APB1ENR_TIM5EN (uint32_t) (1 << 3)  /* TIM5 clock enable */
#define RCC_APB1ENR_TIM6EN (uint32_t) (1 << 4)  /* TIM6 clock enable */
#define RCC_APB1ENR_TIM7EN (uint32_t) (1 << 5)  /* TIM7 clock enable */
#define RCC_APB1ENR_TIM12EN (uint32_t) (1 << 6) /* TIM12 clock enable */
#define RCC_APB1ENR_TIM13EN (uint32_t) (1 << 7) /* TIM13 clock enable */
#define RCC_APB1ENR_TIM14EN (uint32_t) (1 << 8) /* TIM14 clock enable */
#define RCC_APB1ENR_WWDGEN \
    (uint32_t) (1 << 11) /* Window watchdog clock enable */
#define RCC_APB1ENR_SPI2EN (uint32_t) (1 << 14)   /* SPI2 clock enable */
#define RCC_APB1ENR_SPI3EN (uint32_t) (1 << 15)   /* SPI3 clock enable */
#define RCC_APB1ENR_USART2EN (uint32_t) (1 << 17) /* USART2 clock enable */
#define RCC_APB1ENR_USART3EN (uint32_t) (1 << 18) /* USART3 clock enable */
#define RCC_APB1ENR_USART4EN (uint32_t) (1 << 19) /* USART4 clock enable */
#define RCC_APB1ENR_USART5EN (uint32_t) (1 << 20) /* USART5 clock enable */
#define RCC_APB1ENR_I2C1EN (uint32_t) (1 << 21)   /* I2C1 clock enable */
#define RCC_APB1ENR_I2C2EN (uint32_t) (1 << 22)   /* I2C2 clock enable */
#define RCC_APB1ENR_I2C3EN (uint32_t) (1 << 23)   /* I2C3 clock enable */
#define RCC_APB1ENR_CAN1EN (uint32_t) (1 << 25)   /* CAN1 clock enable */
#define RCC_APB1ENR_CAN2EN (uint32_t) (1 << 26)   /* CAN2 clock enable */
#define RCC_APB1ENR_PWREN \
    (uint32_t) (1 << 28) /* Power interface clock enable */
#define RCC_APB1ENR_DACEN (uint32_t) (1 << 29) /* DAC clock enable */

