birdboat00/f9-kernel/include/platform/stm32l4/registers.h
#define RCC_APB2ENR_TIM1EN (uint32_t) (1 << 0)    /* TIM1 clock enable */
#define RCC_APB2ENR_TIM8EN (uint32_t) (1 << 1)    /* TIM8 clock enable */
#define RCC_APB2ENR_USART1EN (uint32_t) (1 << 14) /* USART1 clock enable */
#define RCC_APB2ENR_USART2EN (uint32_t) (1 << 5)  /* USART2 clock enable */
#define RCC_APB2ENR_ADC1EN (uint32_t) (1 << 8)    /* ADC1 clock enable */
#define RCC_APB2ENR_ADC2EN (uint32_t) (1 << 9)    /* ADC2 clock enable */
#define RCC_APB2ENR_ADC3EN (uint32_t) (1 << 10)   /* ADC3 clock enable */
#define RCC_APB2ENR_SDIOEN (uint32_t) (1 << 11)   /* SDIO clock enable */
#define RCC_APB2ENR_SPI1EN (uint32_t) (1 << 12)   /* SPI1 clock enable */
#define RCC_APB2ENR_SYSCFGEN \
    (uint32_t) (1 << 14) /* System configuration controller clock enable */
#define RCC_APB2ENR_TIM9EN (uint32_t) (1 << 16)  /* TIM9 clock enable */
#define RCC_APB2ENR_TIM10EN (uint32_t) (1 << 17) /* TIM10 clock enable */
#define RCC_APB2ENR_TIM11EN (uint32_t) (1 << 18) /* TIM11 clock enable */

#define FLASH_ACR_PRFTEN (uint32_t) (1 << 8)     /* Prefetch enable */
#define FLASH_ACR_ICEN (uint32_t) (1 << 9)       /* Instruction cache enable */
#define FLASH_ACR_DCEN (uint32_t) (1 << 10)      /* Data cache enable */
#define FLASH_ACR_ICRST (uint32_t) (1 << 11)     /* Instruction cache reset */
#define FLASH_ACR_CCRST (uint32_t) (1 << 12)     /* Data cache reset */
#define FLASH_ACR_LATENCY_M (uint32_t) (7 << 0)  /* Latency mask */
#define FLASH_ACR_LATENCY(n) (uint32_t) (n << 0) /* Latency - n wait states */

/* TIMx */
#define TIMx_CR1_CEN (uint32_t) (1 << 0)      /* TIMx counter enable */
#define TIMx_CR1_UDIS (uint32_t) (1 << 1)     /* TIMx update disable */
#define TIMx_CR1_URS (uint32_t) (1 << 2)      /* TIMx update request source */
#define TIMx_CR1_OPM (uint32_t) (1 << 3)      /* TIMx one-pulse mode */
#define TIMx_CR1_DIR_DOWN (uint32_t) (1 << 4) /* TIMx downcounter */
#define TIMx_CR1_CMS_EDGE                                                     \
    (uint32_t) (0 << 5) /* TIMx center-aligned mode selection - counter up or \
                           down depending on DIR bit */
#define TIMx_CR1_CMS_CM1                                                     \
    (uint32_t) (1 << 5) /* TIMx center-aligned mode selection - up and down, \
                           compare flags set down */
#define TIMx_CR1_CMS_CM2                                                     \
    (uint32_t) (2 << 5) /* TIMx center-aligned mode selection - up and down, \
                           compare flags set up */
#define TIMx_CR1_CMS_CM3                                                     \
    (uint32_t) (3 << 5) /* TIMx center-aligned mode selection - up and down, \
                           compare flags set up/down */
#define TIMx_CR1_ARPE                                                         \
    (uint32_t) (1 << 7)                    /* TIMx auto-reload preload enable \
                                            */
#define TIMx_CR1_CKD_1 (uint32_t) (0 << 8) /* TIMx clock division 1 */
#define TIMx_CR1_CKD_2 (uint32_t) (1 << 8) /* TIMx clock division 2 */
#define TIMx_CR1_CKD_4 (uint32_t) (2 << 8) /* TIMx clock division 4 */

#define TIMx_CR2_CCDS                                                         \
    (uint32_t) (1 << 3) /* TIMx capture/compare DMA requests send when update \
                           event occurs */
#define TIMx_CR2_MMS_RST (uint32_t) (0 << 4) /* TIMx master mode - reset */
#define TIMx_CR2_MMS_EN (uint32_t) (1 << 4)  /* TIMx master mode - enable */
#define TIMx_CR2_MMS_UP (uint32_t) (2 << 4)  /* TIMx master mode - update */
#define TIMx_CR2_MMS_CMP_PUL \
    (uint32_t) (3 << 4) /* TIMx master mode - compare pulse */
#define TIMx_CR2_MMS_CMP_OC1 \
    (uint32_t) (4 << 4) /* TIMx master mode - compare OC1 */
#define TIMx_CR2_MMS_CMP_OC2 \
    (uint32_t) (5 << 4) /* TIMx master mode - compare OC2 */
#define TIMx_CR2_MMS_CMP_OC3 \
    (uint32_t) (6 << 4) /* TIMx master mode - compare OC3 */
#define TIMx_CR2_MMS_CMP_OC4 \
    (uint32_t) (7 << 4) /* TIMx master mode - compare OC4 */
#define TIMx_CR2_TI1_123 \
    (uint32_t) (1 << 7) /* TIMx CH1, CH2, CH3 pins connected to TI1 */

#define TIMx_DIER_UIE (uint32_t) (1 << 0)   /* TIMx update interrupt enable */
#define TIMx_DIER_CC1IE (uint32_t) (1 << 1) /* TIMx CC1 interrupt enable */
#define TIMx_DIER_CC2IE (uint32_t) (1 << 2) /* TIMx CC2 interrupt enable */
#define TIMx_DIER_CC3IE (uint32_t) (1 << 3) /* TIMx CC3 interrupt enable */
#define TIMx_DIER_CC4IE (uint32_t) (1 << 4) /* TIMx CC4 interrupt enable */
#define TIMx_DIER_TIE (uint32_t) (1 << 6)   /* TIMx trigger interrupt enable */
#define TIMx_DIER_UDE (uint32_t) (1 << 8)   /* TIMx update DMA request enable */
#define TIMx_DIER_CC1DE (uint32_t) (1 << 9) /* TIMx CC1 DMA request enable */
#define TIMx_DIER_CC2DE (uint32_t) (1 << 10) /* TIMx CC2 DMA request enable */
#define TIMx_DIER_CC3DE (uint32_t) (1 << 11) /* TIMx CC3 DMA request enable */
#define TIMx_DIER_CC4DE (uint32_t) (1 << 12) /* TIMx CC4 DMA request enable */
#define TIMx_DIER_TDE                                       \
    (uint32_t) (1 << 14) /* TIMx trigger DMA request enable \
                          */

/* SPI */
#define SPI_CR1_CPHA (uint32_t) (1 << 0)     /* SPI clock phase */
#define SPI_CR1_CPOL (uint32_t) (1 << 1)     /* SPI clock polarity */
#define SPI_CR1_MSTR (uint32_t) (1 << 2)     /* SPI master selection */
#define SPI_CR1_BR_2 (uint32_t) (0 << 3)     /* SPI baud rate = fPCLK/2 */
#define SPI_CR1_BR_4 (uint32_t) (1 << 3)     /* SPI baud rate = fPCLK/4 */
#define SPI_CR1_BR_8 (uint32_t) (2 << 3)     /* SPI baud rate = fPCLK/8 */
#define SPI_CR1_BR_16 (uint32_t) (3 << 3)    /* SPI baud rate = fPCLK/16 */
#define SPI_CR1_BR_32 (uint32_t) (4 << 3)    /* SPI baud rate = fPCLK/32 */
#define SPI_CR1_BR_64 (uint32_t) (5 << 3)    /* SPI baud rate = fPCLK/64 */
#define SPI_CR1_BR_128 (uint32_t) (6 << 3)   /* SPI baud rate = fPCLK/128 */
#define SPI_CR1_BR_256 (uint32_t) (7 << 3)   /* SPI baud rate = fPCLK/256 */
#define SPI_CR1_SPE (uint32_t) (1 << 6)      /* SPI enable */
#define SPI_CR1_LSBFIRST (uint32_t) (1 << 7) /* SPI LSB transmitted first */
#define SPI_CR1_SSI (uint32_t) (1 << 8)      /* SPI internal slave select */
#define SPI_CR1_SSM (uint32_t) (1 << 9)      /* SPI software slave management */
#define SPI_CR1_DFF \
    (uint32_t) (1 << 11) /* SPI data frame format (0 = 8bit, 1 = 16bit) */
#define SPI_SR_RXNE (uint32_t) (1 << 0)   /* SPI receive not empty */
#define SPI_SR_TXNE (uint32_t) (1 << 1)   /* SPI transmit not empty */
#define SPI_SR_CHSIDE (uint32_t) (1 << 2) /* SPI channel side */
#define SPI_SR_UDR (uint32_t) (1 << 3)    /* SPI underrun flag */
#define SPI_SR_CRCERR (uint32_t) (1 << 4) /* SPI CRC error flag */
#define SPI_SR_MODF (uint32_t) (1 << 5)   /* SPI mode fault */
#define SPI_SR_OVR (uint32_t) (1 << 6)    /* SPI overrun flag */
#define SPI_SR_BSY (uint32_t) (1 << 7)    /* SPI busy flag */
#define SPI_SR_TIRFE (uint32_t) (1 << 8)  /* SPI TI frame format error */

/* I2C */
#define I2C_CR1_PE (uint32_t) (1 << 0)    /* I2C peripheral enable */
#define I2C_CR1_SMBUS (uint32_t) (1 << 1) /* I2C SMBus mode */
#define I2C_CR1_SMBTYPE \
    (uint32_t) (1 << 3) /* I2C SMBus type (0=Device, 1=Host) */
#define I2C_CR1_ENARP (uint32_t) (1 << 4) /* I2C enable ARP */
#define I2C_CR1_ENPEC (uint32_t) (1 << 5) /* I2C enable PEC */
#define I2C_CR1_ENGC (uint32_t) (1 << 6)  /* I2C enable general call */
#define I2C_CR1_NOSTRETCH                                                  \
    (uint32_t) (1 << 7)                    /* I2C clock stretching disable \
                                            */
#define I2C_CR1_START (uint32_t) (1 << 8)  /* I2C START generation */
#define I2C_CR1_STOP (uint32_t) (1 << 9)   /* I2C STOP generation */
#define I2C_CR1_ACK (uint32_t) (1 << 10)   /* I2C ACK enable */
#define I2C_CR1_POS (uint32_t) (1 << 11)   /* I2C ACK/PEC position */
#define I2C_CR1_PEC (uint32_t) (1 << 12)   /* I2C packet error checking */
#define I2C_CR1_ALERT (uint32_t) (1 << 13) /* I2C SMBus alert */
#define I2C_CR1_SWRST (uint32_t) (1 << 15) /* I2C software reset */

#define I2C_CR2_FREQ(n) (uint32_t) (n << 0)  /* I2C clock frequency */
#define I2C_CR2_ITERREN (uint32_t) (1 << 8)  /* I2C error interrupt enable */
#define I2C_CR2_ITEVTEN (uint32_t) (1 << 9)  /* I2C event interrupt enable */
#define I2C_CR2_ITBUFEN (uint32_t) (1 << 10) /* I2C buffer interrupt enable */
#define I2C_CR2_DMAEN (uint32_t) (1 << 11)   /* I2C DMA requests enable */
#define I2C_CR2_LAST (uint32_t) (1 << 12)    /* I2C DMA last transfer */

#define I2C_OAR1_ADD10(n) \
    (uint32_t) (n << 0) /* I2C interface address (10-bit) */
#define I2C_OAR1_ADD7(n)                                 \
    (uint32_t) (n << 1) /* I2C interface address (7-bit) \
                         */
#define I2C_OAR1_ADDMODE \
    (uint32_t) (1 << 15) /* I2C interface address mode (1=10-bit) */

#define I2C_OAR2_ENDUAL (uint32_t) (1 << 0) /* I2C dual address mode enable */
#define I2C_OAR2_ADD2(n) \
    (uint32_t) (n << 1) /* I2C interface address 2 (7-bit) */

