birdboat00/f9-kernel/include/platform/stm32l4/registers.h
#define I2C_SR1_SB (uint32_t) (1 << 0)        /* I2C start bit generated */
#define I2C_SR1_ADDR (uint32_t) (1 << 1)      /* I2C address sent/matched */
#define I2C_SR1_BTF (uint32_t) (1 << 2)       /* I2C byte transfer finished */
#define I2C_SR1_ADD10 (uint32_t) (1 << 3)     /* I2C 10-bit header sent */
#define I2C_SR1_STOPF (uint32_t) (1 << 4)     /* I2C stop detection */
#define I2C_SR1_RXNE (uint32_t) (1 << 6)      /* I2C DR not empty */
#define I2C_SR1_TXE (uint32_t) (1 << 7)       /* I2C DR empty */
#define I2C_SR1_BERR (uint32_t) (1 << 8)      /* I2C bus error */
#define I2C_SR1_ARLO (uint32_t) (1 << 9)      /* I2C attribution lost */
#define I2C_SR1_AF (uint32_t) (1 << 10)       /* I2C acknowledge failure */
#define I2C_SR1_OVR (uint32_t) (1 << 11)      /* I2C overrun/underrun */
#define I2C_SR1_PECERR (uint32_t) (1 << 12)   /* I2C PEC error in reception */
#define I2C_SR1_TIMEOUT (uint32_t) (1 << 14)  /* I2C timeout or tlow error */
#define I2C_SR1_SMBALERT (uint32_t) (1 << 15) /* I2C SMBus alert */

#define I2C_SR2_MSL (uint32_t) (1 << 0)     /* I2C master/slave */
#define I2C_SR2_BUSY (uint32_t) (1 << 1)    /* I2C bus busy */
#define I2C_SR2_TRA (uint32_t) (1 << 2)     /* I2C transmitter/receiver */
#define I2C_SR2_GENCALL (uint32_t) (1 << 4) /* I2C general call address */
#define I2C_SR2_SMBDEFAULT \
    (uint32_t) (1 << 5) /* I2C SMBus device default address */
#define I2C_SR2_SMBHOST (uint32_t) (1 << 6) /* I2C SMBus host header */
#define I2C_SR2_DUALF (uint32_t) (1 << 7)   /* I2C dual flag */
#define I2C_SR2_PEC(r) \
    (uint32_t) (r >> 8) /* I2C packet error checking register */

#define I2C_CCR_CCR(n)                                                  \
    (uint32_t) (n & 0x0FFF)               /* I2C clock control register \
                                           */
#define I2C_CCR_DUTY (uint32_t) (1 << 14) /* I2C fast mode duty cycle */
#define I2C_CCR_FS (uint32_t) (1 << 15)   /* I2C master mode selection */

/* USART */
#define USART_SR_TC (uint32_t) (1 << 6) /* USART Transmission Complete */
#define USART_SR_RXNE \
    (uint32_t) (1 << 5) /* USART Read data register not empty */

/* USART_CR1 */
#define USART_CR1_OVER8 (uint32_t) (1 << 15) /* Oversampling mode */
#define USART_CR1_UE (uint32_t) (1 << 13)    /* USART Enable */
#define USART_CR1_M9                                         \
    (uint32_t) (1 << 12) /* World length 1: 9 bits, 0: 8bits \
                          */
#define USART_CR1_WAKE (uint32_t) (1 << 11) /* Wakeup method */
#define USART_CR1_PCE (uint32_t) (1 << 10)  /* PCE Parity control enable */
#define USART_CR1_PS (uint32_t) (1 << 9)    /* Parity selection */
#define USART_CR1_PEIE (uint32_t) (1 << 8)  /* PE Interrupt enable */
#define USART_CR1_TXEIE (uint32_t) (1 << 7) /* TXE interrupt enable */
#define USART_CR1_TCIE \
    (uint32_t) (1 << 6) /* Transmission complete interrupt enable */
#define USART_CR1_RXNEIE (uint32_t) (1 << 5) /* RXNE Interrupt Enable */
#define USART_CR1_IDLEIE (uint32_t) (1 << 4) /* IDEL INterrupt Enable */
#define USART_CR1_TE (uint32_t) (1 << 3)     /* USART Transmit Enable */
#define USART_CR1_RE (uint32_t) (1 << 2)     /* USART Receive Enable */
#define USART_CR1_RWU (uint32_t) (1 << 1)
#define USART_CR1_SBK (uint32_t) (1 << 0) /* Send break characters */

#define USART_CR3_DMAR_EN (uint32_t) (1 << 6) /* USART DMA Receive Enable */
#define USART_CR3_DMAT_EN (uint32_t) (1 << 7) /* USART DMA Transmit Enable */

/* GPIO */
#define GPIOA (uint8_t) (0) /* GPIO Port A */
#define GPIOB (uint8_t) (1) /* GPIO Port B */
#define GPIOC (uint8_t) (2) /* GPIO Port C */
#define GPIOD (uint8_t) (3) /* GPIO Port D */
#define GPIOE (uint8_t) (4) /* GPIO Port E */
#define GPIOF (uint8_t) (5) /* GPIO Port F */
#define GPIOG (uint8_t) (6) /* GPIO Port G */
#define GPIOH (uint8_t) (7) /* GPIO Port H */
#define GPIOI (uint8_t) (8) /* GPIO Port I */

#define GPIO_MODER_PIN(n) (uint32_t) (2 * n)      /* Pin bitshift */
#define GPIO_MODER_M(n) (uint32_t) (0x3 << 2 * n) /* Pin mask */
#define GPIO_MODER_IN (uint32_t) (0x0)            /* Input mode */
#define GPIO_MODER_OUT (uint32_t) (0x1)           /* Output mode */
#define GPIO_MODER_ALT (uint32_t) (0x2) /* Alternative function mode */
#define GPIO_MODER_ANA (uint32_t) (0x3) /* Analog mode */

#define GPIO_OTYPER_PIN(n) (uint32_t) (n)    /* Pin bitshift */
#define GPIO_OTYPER_M(n) (uint32_t) (1 << n) /* Pin mask */
#define GPIO_OTYPER_PP (uint32_t) (0x0)      /* Output push-pull */
#define GPIO_OTYPER_OD (uint32_t) (0x1)      /* Output open drain */

#define GPIO_OSPEEDR_PIN(n) (uint32_t) (2 * n)        /* Pin bitshift */
#define GPIO_OSPEEDR_M(n) (uint32_t) (0x3 << (2 * n)) /* Pin mask */
#define GPIO_OSPEEDR_2M (uint32_t) (0x0)              /* Output speed 2MHz */
#define GPIO_OSPEEDR_25M (uint32_t) (0x1)             /* Output speed 25MHz */
#define GPIO_OSPEEDR_50M (uint32_t) (0x2)             /* Output speed 50MHz */
#define GPIO_OSPEEDR_100M (uint32_t) (0x3)            /* Output speed 100MHz */

#define GPIO_PUPDR_PIN(n) (uint32_t) (2 * n)        /* Pin bitshift */
#define GPIO_PUPDR_M(n) (uint32_t) (0x3 << (2 * n)) /* Pin mask */
#define GPIO_PUPDR_NONE (uint32_t) (0x0) /* Port no pull-up, pull-down */
#define GPIO_PUPDR_UP (uint32_t) (0x1)   /* Port pull-up */
#define GPIO_PUPDR_DOWN (uint32_t) (0x2) /* Port pull-down */

#define GPIO_IDR_PIN(n) (uint32_t) (1 << n) /* Input for pin n */

#define GPIO_ODR_PIN(n) (uint32_t) (1 << n) /* Output for pin n */

#define GPIO_BSRR_BS(n) (uint32_t) (1 << n)        /* Set pin n */
#define GPIO_BSRR_BR(n) (uint32_t) (1 << (n + 16)) /* Reset pin n */

#define GPIO_AFRL_PIN(n) (uint32_t) (4 * n)              /* Pin bitshift */
#define GPIO_AFRL_M(n) (uint32_t) (0xF << (4 * n))       /* Pin mask */
#define GPIO_AFRH_PIN(n) (uint32_t) (4 * (n - 8))        /* Pin bitshift */
#define GPIO_AFRH_M(n) (uint32_t) (0xF << (4 * (n - 8))) /* Pin mask */

/* DMA */
#define DMA_LISR_TCIF2 \
    (uint32_t) (1 << 21) /* DMA stream 2 transfer complete flag */
#define DMA_HISR_TCIF7 \
    (uint32_t) (1 << 27) /* DMA stream 7 transfer complete flag */
#define DMA_LIFCR_CTCIF2 \
    (uint32_t) (1 << 21) /* DMA clear stream 2 transfer complete flag */
#define DMA_HIFCR_CTCIF7 \
    (uint32_t) (1 << 27) /* DMA clear stream 7 transfer complete flag */

#define DMA_SxCR_EN (uint32_t) (1 << 0) /* DMA stream enable */
#define DMA_SxCR_DMEIE \
    (uint32_t) (1 << 1) /* DMA stream direct mode error interrupt enable */
#define DMA_SxCR_TEIE \
    (uint32_t) (1 << 2) /* DMA stream transmit error interrupt enable */
#define DMA_SxCR_HTIE \
    (uint32_t) (1 << 3) /* DMA stream half transfer interrupt enable */
#define DMA_SxCR_TCIE \
    (uint32_t) (1 << 4) /* DMA stream transfer complete interrupt enable */
#define DMA_SxCR_PFCTRL \
    (uint32_t) (1 << 5) /* DMA stream peripheral flow control */
#define DMA_SxCR_DIR_PM \
    (uint32_t) (0 << 6) /* DMA stream peripheral-to-memory data transfer */
#define DMA_SxCR_DIR_MP \
    (uint32_t) (1 << 6) /* DMA stream memory-to-peripheral data transfer */
#define DMA_SxCR_DIR_MM \
    (uint32_t) (2 << 6) /* DMA stream memory-to-memory data transfer */
#define DMA_SxCR_CIRC                                      \
    (uint32_t) (1 << 8) /* DMA stream circular mode enable \
                         */
#define DMA_SxCR_PINC \
    (uint32_t) (1 << 9) /* DMA stream peripheral increment mode enable */
#define DMA_SxCR_MINC \
    (uint32_t) (1 << 10) /* DMA stream memory increment mode enable */
#define DMA_SxCR_PSIZE_BYTE \
    (uint32_t) (0 << 11) /* DMA stream peripheral data size - Byte */
#define DMA_SxCR_PSIZE_HW \
    (uint32_t) (1 << 11) /* DMA stream peripheral data size - Half-word */
#define DMA_SxCR_PSIZE_WORD \
    (uint32_t) (2 << 11) /* DMA stream peripheral data size - Word */
#define DMA_SxCR_MSIZE_BYTE \
    (uint32_t) (0 << 13) /* DMA stream memory data size - Byte */
#define DMA_SxCR_MSIZE_HW \
    (uint32_t) (1 << 13) /* DMA stream memory data size - Half-word */
#define DMA_SxCR_MSIZE_WORD \
    (uint32_t) (2 << 13) /* DMA stream memory data size - Word */
#define DMA_SxCR_PINCOS_LINKED                                                 \
    (uint32_t) (0 << 15) /* DMA stream peripheral increment offset size linked \
                            to PSIZE */
#define DMA_SxCR_PINCOS_FIXED                                                 \
    (uint32_t) (1 << 15) /* DMA stream peripheral increment offset size fixed \
                          */
#define DMA_SxCR_PL_LOW                                   \
    (uint32_t) (0 << 16) /* DMA stream priority level low \
                          */
#define DMA_SxCR_PL_MED \
    (uint32_t) (1 << 16) /* DMA stream priority level medium */
#define DMA_SxCR_PL_HIGH \
    (uint32_t) (2 << 16) /* DMA stream priority level high */
#define DMA_SxCR_PL_VHIGH \
    (uint32_t) (3 << 16) /* DMA stream priority level very high */
#define DMA_SxCR_DBM (uint32_t) (1 << 18) /* DMA stream double buffer mode */
#define DMA_SxCR_CT \
    (uint32_t) (1 << 19) /* DMA stream current target (M0 or M1) */
#define DMA_SxCR_PBURST_NO \
    (uint32_t) (0 << 21) /* DMA stream peripheral burst disable */
#define DMA_SxCR_PBURST_4 \
    (uint32_t) (1 << 21) /* DMA stream peripheral burst of 4 beats */
#define DMA_SxCR_PBURST_8 \
    (uint32_t) (2 << 21) /* DMA stream peripheral burst of 8 beats */
#define DMA_SxCR_PBURST_16 \
    (uint32_t) (3 << 21) /* DMA stream peripheral burst of 16 beats */
#define DMA_SxCR_MBURST_NO \
    (uint32_t) (0 << 23) /* DMA stream memory burst disable */
#define DMA_SxCR_MBURST_4 \
    (uint32_t) (1 << 23) /* DMA stream memory burst of 4 beats */
#define DMA_SxCR_MBURST_8 \
    (uint32_t) (2 << 23) /* DMA stream memory burst of 8 beats */
#define DMA_SxCR_MBURST_16 \
    (uint32_t) (3 << 23) /* DMA stream memory burst of 16 beats */
#define DMA_SxCR_CHSEL(x) (uint32_t) (x << 25) /* DMA stream channel select */

