birdboat00/f9-kernel/include/platform/stm32l4/registers.h
#define DMA_SxFCR_FTH_1                                  \
    (uint32_t) (0 << 0) /* DMA stream FIFO threshold 1/4 \
                         */
#define DMA_SxFCR_FTH_2                                  \
    (uint32_t) (1 << 0) /* DMA stream FIFO threshold 1/2 \
                         */
#define DMA_SxFCR_FTH_3                                  \
    (uint32_t) (2 << 0) /* DMA stream FIFO threshold 3/4 \
                         */
#define DMA_SxFCR_FTH_4                              \
    (uint32_t) (3 << 0) /* DMA stream FIFO threshold \
                           full*/
#define DMA_SxFCR_DMDIS                                                    \
    (uint32_t) (1 << 2)                  /* DMA stream direct mode disable \
                                          */
#define DMA_SxFCR_FS (uint32_t) (7 << 3) /* DMA stream FIFO status */
#define DMA_SxFCR_FEIE \
    (uint32_t) (1 << 7) /* DMA stream FIFO error interrupt enable */

/* USB FS */
/* Global Registers */
#define USB_FS_GOTGCTL_SRQSCS \
    (uint32_t) (1 << 0)                        /* USB session request success */
#define USB_FS_GOTGCTL_SRQ (uint32_t) (1 << 1) /* USB session request */
#define USB_FS_GOTGCTL_HNGSCS \
    (uint32_t) (1 << 8) /* USB host negotiation success */
#define USB_FS_GOTGCTL_HNP (uint32_t) (1 << 9) /* USB HNP request */
#define USB_FS_GOTGCTL_HSHNPEN \
    (uint32_t) (1 << 10) /* USB host set HPN enable */
#define USB_FS_GOTGCTL_DHNPEN                      \
    (uint32_t) (1 << 11) /* USB device HPN enabled \
                          */
#define USB_FS_GOTGCTL_CIDSTS                                                \
    (uint32_t) (1 << 16)                          /* USB connector ID status \
                                                   */
#define USB_FS_GOTGCTL_DBCT (uint32_t) (1 << 17)  /* USB debounce time */
#define USB_FS_GOTGCTL_ASVLD (uint32_t) (1 << 18) /* USB A session valid */
#define USB_FS_GOTGCTL_BSVLD (uint32_t) (1 << 19) /* USB B session valid */

#define USB_FS_GOTGINT_SEDET                        \
    (uint32_t) (1 << 2) /* USB session end detected \
                         */
#define USB_FS_GOTGINT_SRSSCHG \
    (uint32_t) (1 << 8) /* USB session request success status change */
#define USB_FS_GOTGINT_HNSSCHG \
    (uint32_t) (1 << 9) /* USB host negotiation success status change */
#define USB_FS_GOTGINT_HNGDET \
    (uint32_t) (1 << 17) /* USB host negotiation detected */
#define USB_FS_GOTGINT_ADTOCHG \
    (uint32_t) (1 << 18) /* USB A-device timeout change */
#define USB_FS_GOTGINT_DBCDNE (uint32_t) (1 << 19) /* USB debounce done */

#define USB_FS_GAHBCFG_GINTMSK \
    (uint32_t) (1 << 0) /* USB global interrupt mask */
#define USB_FS_GAHBCFG_TXFELVL                     \
    (uint32_t) (1 << 7) /* USB TX FIFO empty level \
                         */
#define USB_FS_GAHBCFG_PTXFELVL \
    (uint32_t) (1 << 8) /* USB Periodic TX FIFO empty level */

#define USB_FS_GUSBCFG_TOCAL(n) \
    (uint32_t) (n << 0) /* USB FS timeout calibration */
#define USB_FS_GUSBCFG_PHYSEL \
    (uint32_t) (1 << 7) /* USB FS serial transceiver select */
#define USB_FS_GUSBCFG_SRPCAP (uint32_t) (1 << 8) /* USB SRP capable */
#define USB_FS_GUSBCFG_HNPCAP (uint32_t) (1 << 9) /* USB HNP capable */
#define USB_FS_GUSBCFG_TRDT(n) \
    (uint32_t) (n << 10) /* USB turnaround time (4 bits) */
#define USB_FS_GUSBCFG_FHMOD (uint32_t) (1 << 29)  /* USB force host mode */
#define USB_FS_GUSBCFG_FDMOD (uint32_t) (1 << 30)  /* USB force device mode */
#define USB_FS_GUSBCFG_CTXPKT (uint32_t) (1 << 31) /* USB corrupt packet */

#define USB_FS_GRSTCTL_CSRST (uint32_t) (1 << 0) /* USB core soft reset */
#define USB_FS_GRSTCTL_HSRST (uint32_t) (1 << 1) /* USB HCLK soft reset */
#define USB_FS_GRSTCTL_FCRST \
    (uint32_t) (1 << 2) /* USB host frame counter reset */
#define USB_FS_GRSTCTL_RXFFLSH (uint32_t) (1 << 4)   /* USB RX FIFO flush */
#define USB_FS_GRSTCTL_TXFFLSH (uint32_t) (1 << 5)   /* USB TX FIFO flush */
#define USB_FS_GRSTCTL_TXFNUM(n) (uint32_t) (n << 6) /* USB TX FIFO number */
#define USB_FS_GRSTCTL_AHBIDL (uint32_t) (1 << 31)   /* USB AHB master idle */

#define USB_FS_GINTSTS_CMOD \
    (uint32_t) (1 << 0) /* USB current mode of operation */
#define USB_FS_GINTSTS_MMIS \
    (uint32_t) (1 << 1) /* USB mode mismatch interrupt */
#define USB_FS_GINTSTS_OTGINT (uint32_t) (1 << 2) /* USB OTG interrupt */
#define USB_FS_GINTSTS_SOF (uint32_t) (1 << 3)    /* USB start of frame */
#define USB_FS_GINTSTS_RXFLVL (uint32_t) (1 << 4) /* USB RX FIFO non-empty */
#define USB_FS_GINTSTS_NPTXFE \
    (uint32_t) (1 << 5) /* USB non-periodic TX FIFO empty */
#define USB_FS_GINTSTS_GINAKEFF \
    (uint32_t) (1 << 6) /* USB global IN non-periodic NAK effective */
#define USB_FS_GINTSTS_GONAKEFF \
    (uint32_t) (1 << 7) /* USB global OUT NAK effective */
#define USB_FS_GINTSTS_ESUSP (uint32_t) (1 << 10)   /* USB early suspend */
#define USB_FS_GINTSTS_USBSUSP (uint32_t) (1 << 11) /* USB suspend */
#define USB_FS_GINTSTS_USBRST (uint32_t) (1 << 12)  /* USB reset */
#define USB_FS_GINTSTS_ENUMDNE (uint32_t) (1 << 13) /* USB enumeration done */
#define USB_FS_GINTSTS_ISOODRP \
    (uint32_t) (1 << 14) /* USB isochronous OUT packet dropped interrupt */
#define USB_FS_GINTSTS_EOPF \
    (uint32_t) (1 << 15) /* USB end of packet frame interrupt */
#define USB_FS_GINTSTS_IEPINT \
    (uint32_t) (1 << 18) /* USB IN endpoint interrupt */
#define USB_FS_GINTSTS_OEPINT \
    (uint32_t) (1 << 19) /* USB OUT endpoint interrupt */
#define USB_FS_GINTSTS_IISOIXFR \
    (uint32_t) (1 << 20) /* USB incomplete isochronous IN transfer */
#define USB_FS_GINTSTS_IISOOXFR \
    (uint32_t) (1 << 21) /* USB incomplete isochronous OUT transfer */
#define USB_FS_GINTSTS_IPXFR \
    (uint32_t) (1 << 21) /* USB incomplete periodic transfer */
#define USB_FS_GINTSTS_HPRTINT \
    (uint32_t) (1 << 24) /* USB host port interrupt */
#define USB_FS_GINTSTS_HCINT \
    (uint32_t) (1 << 25) /* USB host channels interrupt */
#define USB_FS_GINTSTS_PTXFE \
    (uint32_t) (1 << 26) /* USB periodic TX FIFO empty */
#define USB_FS_GINTSTS_CIDSCHG \
    (uint32_t) (1 << 28) /* USB connector ID status change */
#define USB_FS_GINTSTS_DISCINT \
    (uint32_t) (1 << 29) /* USB disconnect detected interrupt */
#define USB_FS_GINTSTS_SRQINT                                                  \
    (uint32_t) (1 << 30) /* USB session request/new session detected interrupt \
                          */
#define USB_FS_GINTSTS_WKUPINT \
    (uint32_t) (1 << 31) /* USB resume/remote wakeup detected interrupt */

#define USB_FS_GINTMSK_MMISM \
    (uint32_t) (1 << 1) /* USB mode mismatch interrupt mask */
#define USB_FS_GINTMSK_OTGINT (uint32_t) (1 << 2) /* USB OTG interrupt mask */
#define USB_FS_GINTMSK_SOFM (uint32_t) (1 << 3)   /* USB start of frame mask */
#define USB_FS_GINTMSK_RXFLVLM \
    (uint32_t) (1 << 4) /* USB RX FIFO non-empty mask */
#define USB_FS_GINTMSK_NPTXFEM \
    (uint32_t) (1 << 5) /* USB non-periodic TX FIFO empty mask */
#define USB_FS_GINTMSK_GINAKEFFM \
    (uint32_t) (1 << 6) /* USB global IN non-periodic NAK effective mask */
#define USB_FS_GINTMSK_GONAKEFFM \
    (uint32_t) (1 << 7) /* USB global OUT NAK effective mask */
#define USB_FS_GINTMSK_ESUSPM                                                  \
    (uint32_t) (1 << 10)                             /* USB early suspend mask \
                                                      */
#define USB_FS_GINTMSK_USBSUSPM (uint32_t) (1 << 11) /* USB suspend mask */
#define USB_FS_GINTMSK_USBRSTM (uint32_t) (1 << 12)  /* USB reset mask */
#define USB_FS_GINTMSK_ENUMDNEM \
    (uint32_t) (1 << 13) /* USB enumeration done mask */
#define USB_FS_GINTMSK_ISOODRPM                                               \
    (uint32_t) (1 << 14) /* USB isochronous OUT packet dropped interrupt mask \
                          */
#define USB_FS_GINTMSK_EOPFM \
    (uint32_t) (1 << 15) /* USB end of packet frame interrupt mask */
#define USB_FS_GINTMSK_EPMISM \
    (uint32_t) (1 << 17) /* USB endpoint mismatch interrupt mask */
#define USB_FS_GINTMSK_IEPINT \
    (uint32_t) (1 << 18) /* USB IN endpoint interrupt mask */
#define USB_FS_GINTMSK_OEPINT \
    (uint32_t) (1 << 19) /* USB OUT endpoint interrupt mask */
#define USB_FS_GINTMSK_IISOIXFRM \
    (uint32_t) (1 << 20) /* USB incomplete isochronous IN transfer mask */
#define USB_FS_GINTMSK_IISOOXFRM \
    (uint32_t) (1 << 21) /* USB incomplete isochronous OUT transfer mask */
#define USB_FS_GINTMSK_IPXFRM \
    (uint32_t) (1 << 21) /* USB incomplete periodic transfer mask */
#define USB_FS_GINTMSK_HPRTINT \
    (uint32_t) (1 << 24) /* USB host port interrupt mask */
#define USB_FS_GINTMSK_HCINT \
    (uint32_t) (1 << 25) /* USB host channels interrupt mask */
#define USB_FS_GINTMSK_PTXFEM \
    (uint32_t) (1 << 26) /* USB periodic TX FIFO empty mask */
#define USB_FS_GINTMSK_CIDSCHGM \
    (uint32_t) (1 << 28) /* USB connector ID status change mask */
#define USB_FS_GINTMSK_DISCINT \
    (uint32_t) (1 << 29) /* USB disconnect detected interrupt mask */
#define USB_FS_GINTMSK_SRQINT                                                  \
    (uint32_t) (1 << 30) /* USB session request/new session detected interrupt \
                            mask */
#define USB_FS_GINTMSK_WKUPINT                                               \
    (uint32_t) (1 << 31) /* USB resume/remote wakeup detected interrupt mask \
                          */

#define USB_FS_GRXSTS_EPNUM(r) \
    (uint32_t) (r & 0xF) /* USB RX FIFO endpoint number */
#define USB_FS_GRXSTS_BCNT(r) \
    (uint32_t) ((r & 0x7FF0) >> 4) /* USB RX FIFO byte count */
#define USB_FS_GRXSTS_DPID(r) \
    (uint32_t) ((r & 0x18000) >> 15) /* USB RX FIFO data PID */
#define USB_FS_GRXSTS_PKTSTS(r) \
    (uint32_t) ((r & 0x1E0000) >> 17) /* USB RX FIFO packet status */
#define USB_FS_GRXSTS_FRMNUM(r) \
    (uint32_t) ((r & 0x1E00000) >> 21) /* USB RX FIFO frame number */
#define USB_FS_GRXSTS_PKTSTS_NAK \
    (uint8_t) (1) /* USB RX FIFO packet status = global OUT NAK */
#define USB_FS_GRXSTS_PKTSTS_ORX \
    (uint8_t) (2) /* USB RX FIFO packet status = OUT data packet received */
#define USB_FS_GRXSTS_PKTSTS_OCP \
    (uint8_t) (3) /* USB RX FIFO packet status = OUT transfer completed */
#define USB_FS_GRXSTS_PKTSTS_STUPCP                                          \
    (uint8_t) (4) /* USB RX FIFO packet status = SETUP transaction completed \
                   */
#define USB_FS_GRXSTS_PKTSTS_STUPRX \
    (uint8_t) (6) /* USB RX FIFO packet status = SETUP data packet received */

