birdboat00/f9-kernel/include/platform/stm32l4/registers.h
#define USB_FS_DIEPTXF0_TX0FSA(n) \
    (uint32_t) (n << 0) /* USB endpoint 0 transmit RAM start address */
#define USB_FS_DIEPTXF0_TX0FD(n) \
    (uint32_t) (n << 16) /* USB endpoint 0 TX FIFO depth */

#define USB_FS_GCCFG_PWRDWN (uint32_t) (1 << 16) /* USB power down */
#define USB_FS_GCCFG_VBUSASEN \
    (uint32_t) (1 << 18) /* USB VBUS "A" sensing enable */
#define USB_FS_GCCFG_VBUSBSEN \
    (uint32_t) (1 << 19) /* USB VBUS "B" sensing enable */
#define USB_FS_GCCFG_SOFOUTEN (uint32_t) (1 << 20) /* USB SOF output enable */
#define USB_FS_GCCFG_NOVBUSSSENS \
    (uint32_t) (1 << 21) /* USB VBUS sensing disable */

#define USB_FS_DIEPTXF_INEPTXSA(n) \
    (uint32_t) (n << 0) /* USB IN endpoint FIFOx transmit RAM start address */
#define USB_FS_DIEPTXF_INEPTXFD(n) \
    (uint32_t) (n << 16) /* USB IN endpoint TX FIFOx depth */

/* Device-mode Registers */
#define USB_FS_DCFG_DSPD_FS \
    (uint32_t) (1 << 1 | 1 << 0) /* USB device speed: full speed (USB 1.1) */
#define USB_FS_DCFG_NZLSOHSK \
    (uint32_t) (1 << 2) /* USB device non-zero-length status OUT handshake */
#define USB_FS_DCFG_DAD(x) (uint32_t) (x << 4) /* USB device address */
#define USB_FS_DCFG_PFIVL_80 \
    (uint32_t) (0 << 11) /* USB device periodic frame interval: 80% */
#define USB_FS_DCFG_PFIVL_85 \
    (uint32_t) (1 << 11) /* USB device periodic frame interval: 85% */
#define USB_FS_DCFG_PFIVL_90 \
    (uint32_t) (2 << 11) /* USB device periodic frame interval: 90% */
#define USB_FS_DCFG_PFIVL_95 \
    (uint32_t) (3 << 11) /* USB device periodic frame interval: 95% */

#define USB_FS_DCTL_RWUSIG \
    (uint32_t) (1 << 0) /* USB device remote wakeup signaling */
#define USB_FS_DCTL_SDIS (uint32_t) (1 << 1) /* USB device soft disconnect */
#define USB_FS_DCTL_GINSTS \
    (uint32_t) (1 << 2) /* USB device global IN NAK status */
#define USB_FS_DCTL_GONSTS \
    (uint32_t) (1 << 3) /* USB device global OUT NAK status */
#define USB_FS_DCTL_TCTL_J (uint32_t) (1 << 4) /* USB device Test_J mode */
#define USB_FS_DCTL_TCTL_K (uint32_t) (2 << 4) /* USB device Test_K mode */
#define USB_FS_DCTL_TCTL_SE0_NAK \
    (uint32_t) (3 << 4) /* USB device Test_SE0_NAK mode */
#define USB_FS_DCTL_TCTL_PKT \
    (uint32_t) (4 << 4) /* USB device Test_Packet mode */
#define USB_FS_DCTL_TCTL_FEN \
    (uint32_t) (5 << 4) /* USB device Test_Force_Enable mode */
#define USB_FS_DCTL_SGINAK \
    (uint32_t) (1 << 7) /* USB device set global IN NAK */
#define USB_FS_DCTL_CGINAK \
    (uint32_t) (1 << 8) /* USB device clear global IN NAK */
#define USB_FS_DCTL_SGONAK \
    (uint32_t) (1 << 9) /* USB device set global OUT NAK */
#define USB_FS_DCTL_CGONAK \
    (uint32_t) (1 << 10) /* USB device clear global OUT NAK */
#define USB_FS_DCTL_POPRGDNE \
    (uint32_t) (1 << 11) /* USB device power-no programming done */

#define USB_FS_DSTS_SUSPSTS                          \
    (uint32_t) (1 << 0) /* USB device suspend status \
                         */
#define USB_FS_DSTS_ENUMSPD \
    (uint32_t) (3 << 1) /* USB device enumerated speed (Must == 3) */
#define USB_FS_DSTS_ENUMSPD_FS \
    (uint32_t) (3 << 1) /* USB device enumerated speed (Must == 3) */
#define USB_FS_DSTS_EERR (uint32_t) (1 << 3) /* USB device erratic error */
#define USB_FS_DSTS_FNSOF                                                  \
    (uint32_t) (0x3FFF00) /* USB device frame number of received SOF (bits \
                             21:8) */

#define USB_FS_DIEPMSK_XFRCM \
    (uint32_t) (1 << 0) /* USB device transfer completed interrupt mask */
#define USB_FS_DIEPMSK_EPDM \
    (uint32_t) (1 << 1) /* USB device endpoint disabled interrupt mask */
#define USB_FS_DIEPMSK_TOM \
    (uint32_t) (1 << 3) /* USB device timout condition mask */
#define USB_FS_DIEPMSK_ITTXFEMSK                                           \
    (uint32_t) (1 << 4) /* USB device IN token received when TX FIFO empty \
                           mask */
#define USB_FS_DIEPMSK_INEPNMM                                                \
    (uint32_t) (1 << 5) /* USB device IN token received with EP mismatch mask \
                         */
#define USB_FS_DIEPMSK_INEPNEM \
    (uint32_t) (1 << 6) /* USB device IN endpoint NAK effective mask */

#define USB_FS_DOEPMSK_XFRCM \
    (uint32_t) (1 << 0) /* USB device transfer completed interrupt mask */
#define USB_FS_DOEPMSK_EPDM \
    (uint32_t) (1 << 1) /* USB device endpoint disabled interrupt mask */
#define USB_FS_DOEPMSK_STUPM \
    (uint32_t) (1 << 3) /* USB device SETUP phase done mask */
#define USB_FS_DOEPMSK_OTEPDM                                          \
    (uint32_t) (1 << 4) /* USB device OUT token received when endpoint \
                           disabled mask */

#define USB_FS_DAINT_IEPINT(n) \
    (uint32_t) (1 << n) /* USB device IN endpoint interrupt bits */
#define USB_FS_DAINT_OEPINT(n) \
    (uint32_t) (1 << (n + 16)) /* USB device OUT endpoint interrupt bits */

#define USB_FS_DAINT_IEPM(n) \
    (uint32_t) (1 << n) /* USB device IN endpoint interrupt mask bits */
#define USB_FS_DAINT_OEPM(n)                                                  \
    (uint32_t) (1 << (n + 16)) /* USB device OUT endpoint interrupt mask bits \
                                */

#define USB_FS_DIEPEMPMSK_INEPTXFEM(n)                                        \
    (uint32_t) (1 << n) /* USB device IN EP TX FIFO empty interrupt mask bits \
                         */

#define USB_FS_DIEPCTL0_MPSIZE \
    (uint32_t) (3 << 0) /* USB device endpoint 0 IN maximum packet size */
#define USB_FS_DIEPCTL0_MPSIZE_64                                          \
    (uint32_t) (0 << 0) /* USB device endpoint 0 IN maximum packet size 64 \
                           bytes */
#define USB_FS_DIEPCTL0_MPSIZE_32                                          \
    (uint32_t) (1 << 0) /* USB device endpoint 0 IN maximum packet size 32 \
                           bytes */
#define USB_FS_DIEPCTL0_MPSIZE_16                                          \
    (uint32_t) (2 << 0) /* USB device endpoint 0 IN maximum packet size 16 \
                           bytes */
#define USB_FS_DIEPCTL0_MPSIZE_8                                          \
    (uint32_t) (3 << 0) /* USB device endpoint 0 IN maximum packet size 8 \
                           bytes */
#define USB_FS_DIEPCTL0_USBAEP                                           \
    (uint32_t) (1 << 15) /* USB device endpoint 0 IN USB active endpoint \
                            (always 1) */
#define USB_FS_DIEPCTL0_NAKSTS \
    (uint32_t) (1 << 17) /* USB device endpoint 0 IN NAK status */
#define USB_FS_DIEPCTL0_STALL \
    (uint32_t) (1 << 21) /* USB device endpoint 0 IN STALL handshake */
#define USB_FS_DIEPCTL0_TXFNUM(n) \
    (uint32_t) (n << 22) /* USB device endpoint 0 IN TX FIFO number */
#define USB_FS_DIEPCTL0_CNAK \
    (uint32_t) (1 << 26) /* USB device endpoint 0 IN clear NAK */
#define USB_FS_DIEPCTL0_SNAK \
    (uint32_t) (1 << 27) /* USB device endpoint 0 IN set NAK */
#define USB_FS_DIEPCTL0_EPDIS \
    (uint32_t) (1 << 30) /* USB device endpoint 0 IN endpoint disable */
#define USB_FS_DIEPCTL0_EPENA \
    (uint32_t) (1 << 31) /* USB device endpoint 0 IN endpoint enable */

#define USB_FS_DIEPCTLx_MPSIZE(n)                                          \
    (uint32_t) (n << 0) /* USB device endpoint x IN maximum packet size in \
                           bytes (11 bits) */
#define USB_FS_DIEPCTLx_USBAEP \
    (uint32_t) (1 << 15) /* USB device endpoint x IN USB active endpoint */
#define USB_FS_DIEPCTLx_EONUM_EVEN \
    (uint32_t) (0 << 16) /* USB device endpoint x IN Odd frame */
#define USB_FS_DIEPCTLx_EONUM_ODD \
    (uint32_t) (1 << 16) /* USB device endpoint x IN Odd frame */
#define USB_FS_DIEPCTLx_DPID_0 \
    (uint32_t) (0 << 16) /* USB device endpoint x IN data PID 0 */
#define USB_FS_DIEPCTLx_DPID_1 \
    (uint32_t) (1 << 16) /* USB device endpoint x IN data PID 1 */
#define USB_FS_DIEPCTLx_NAKSTS \
    (uint32_t) (1 << 17) /* USB device endpoint x IN NAK status */
#define USB_FS_DIEPCTLx_EPTYP_CTL \
    (uint32_t) (0 << 18) /* USB device endpoint x IN type: control */
#define USB_FS_DIEPCTLx_EPTYP_ISO \
    (uint32_t) (1 << 18) /* USB device endpoint x IN type: isochronous */
#define USB_FS_DIEPCTLx_EPTYP_BLK \
    (uint32_t) (2 << 18) /* USB device endpoint x IN type: bulk */
#define USB_FS_DIEPCTLx_EPTYP_INT \
    (uint32_t) (3 << 18) /* USB device endpoint x IN type: interrupt */
#define USB_FS_DIEPCTLx_STALL \
    (uint32_t) (1 << 21) /* USB device endpoint x IN STALL handshake */
#define USB_FS_DIEPCTLx_TXFNUM(n)                                            \
    (uint32_t) (n << 22) /* USB device endpoint x IN TX FIFO number (4 bits) \
                          */
#define USB_FS_DIEPCTLx_CNAK \
    (uint32_t) (1 << 26) /* USB device endpoint x IN clear NAK */
#define USB_FS_DIEPCTLx_SNAK \
    (uint32_t) (1 << 27) /* USB device endpoint x IN set NAK */
#define USB_FS_DIEPCTLx_SD0PID \
    (uint32_t) (1 << 28) /* USB device endpoint x IN set DATA0 PID */
#define USB_FS_DIEPCTLx_SEVNFRM \
    (uint32_t) (1 << 28) /* USB device endpoint x IN set even frame */
#define USB_FS_DIEPCTLx_SODDFRM \
    (uint32_t) (1 << 29) /* USB device endpoint x IN set odd frame */
#define USB_FS_DIEPCTLx_EPDIS \
    (uint32_t) (1 << 30) /* USB device endpoint x IN endpoint disable */
#define USB_FS_DIEPCTLx_EPENA \
    (uint32_t) (1 << 31) /* USB device endpoint x IN endpoint enable */

#define USB_FS_DOEPCTL0_MPSIZE \
    (uint32_t) (3 << 0) /* USB device endpoint 0 OUT maximum packet size */
#define USB_FS_DOEPCTL0_MPSIZE_64                                           \
    (uint32_t) (0 << 0) /* USB device endpoint 0 OUT maximum packet size 64 \
                           bytes */
#define USB_FS_DOEPCTL0_MPSIZE_32                                           \
    (uint32_t) (1 << 0) /* USB device endpoint 0 OUT maximum packet size 32 \
                           bytes */
#define USB_FS_DOEPCTL0_MPSIZE_16                                           \
    (uint32_t) (2 << 0) /* USB device endpoint 0 OUT maximum packet size 16 \
                           bytes */
#define USB_FS_DOEPCTL0_MPSIZE_8                                           \
    (uint32_t) (3 << 0) /* USB device endpoint 0 OUT maximum packet size 8 \
                           bytes */
#define USB_FS_DOEPCTL0_USBAEP                                            \
    (uint32_t) (1 << 15) /* USB device endpoint 0 OUT USB active endpoint \
                            (always 1) */
#define USB_FS_DOEPCTL0_NAKSTS \
    (uint32_t) (1 << 17) /* USB device endpoint 0 OUT NAK status */
#define USB_FS_DOEPCTL0_SNPM \
    (uint32_t) (1 << 20) /* USB device endpoint 0 OUT snoop mode */
#define USB_FS_DOEPCTL0_STALL \
    (uint32_t) (1 << 21) /* USB device endpoint 0 OUT STALL handshake */
#define USB_FS_DOEPCTL0_CNAK \
    (uint32_t) (1 << 26) /* USB device endpoint 0 OUT clear NAK */
#define USB_FS_DOEPCTL0_SNAK \
    (uint32_t) (1 << 27) /* USB device endpoint 0 OUT set NAK */
#define USB_FS_DOEPCTL0_EPDIS \
    (uint32_t) (1 << 30) /* USB device endpoint 0 OUT endpoint disable */
#define USB_FS_DOEPCTL0_EPENA \
    (uint32_t) (1 << 31) /* USB device endpoint 0 OUT endpoint enable */

#define USB_FS_DOEPCTLx_MPSIZE(n)                                           \
    (uint32_t) (n << 0) /* USB device endpoint x OUT maximum packet size in \
                           bytes (11 bits) */
#define USB_FS_DOEPCTLx_USBAEP \
    (uint32_t) (1 << 15) /* USB device endpoint x OUT USB active endpoint */
#define USB_FS_DOEPCTLx_EONUM_EVEN \
    (uint32_t) (0 << 16) /* USB device endpoint x OUT Odd frame */
#define USB_FS_DOEPCTLx_EONUM_ODD \
    (uint32_t) (1 << 16) /* USB device endpoint x OUT Odd frame */
#define USB_FS_DOEPCTLx_DPID_0 \
    (uint32_t) (0 << 16) /* USB device endpoint x OUT data PID 0 */
#define USB_FS_DOEPCTLx_DPID_1 \
    (uint32_t) (1 << 16) /* USB device endpoint x OUT data PID 1 */
#define USB_FS_DOEPCTLx_NAKSTS \
    (uint32_t) (1 << 17) /* USB device endpoint x OUT NAK status */
#define USB_FS_DOEPCTLx_EPTYP_CTL \
    (uint32_t) (0 << 18) /* USB device endpoint x OUT type: control */
#define USB_FS_DOEPCTLx_EPTYP_ISO \
    (uint32_t) (1 << 18) /* USB device endpoint x OUT type: isochronous */
#define USB_FS_DOEPCTLx_EPTYP_BLK \
    (uint32_t) (2 << 18) /* USB device endpoint x OUT type: bulk */
#define USB_FS_DOEPCTLx_EPTYP_INT \
    (uint32_t) (3 << 18) /* USB device endpoint x OUT type: interrupt */
#define USB_FS_DOEPCTLx_SNPMN \
    (uint32_t) (1 << 20) /* USB device endpoint x OUT snoop mode */
#define USB_FS_DOEPCTLx_STALL \
    (uint32_t) (1 << 21) /* USB device endpoint x OUT STALL handshake */
#define USB_FS_DOEPCTLx_CNAK \
    (uint32_t) (1 << 26) /* USB device endpoint x OUT clear NAK */
#define USB_FS_DOEPCTLx_SNAK \
    (uint32_t) (1 << 27) /* USB device endpoint x OUT set NAK */
#define USB_FS_DOEPCTLx_SD0PID \
    (uint32_t) (1 << 28) /* USB device endpoint x OUT set DATA0 PID */
#define USB_FS_DOEPCTLx_SEVNFRM \
    (uint32_t) (1 << 28) /* USB device endpoint x OUT set even frame */
#define USB_FS_DOEPCTLx_SODDFRM \
    (uint32_t) (1 << 29) /* USB device endpoint x OUT set odd frame */
#define USB_FS_DOEPCTLx_EPDIS \
    (uint32_t) (1 << 30) /* USB device endpoint x OUT endpoint disable */
#define USB_FS_DOEPCTLx_EPENA \
    (uint32_t) (1 << 31) /* USB device endpoint x OUT endpoint enable */

#define USB_FS_DIEPINTx_XFRC                                          \
    (uint32_t) (1 << 0) /* USB device endpoint x IN transfer complete \
                           interrupt */
#define USB_FS_DIEPINTx_EPDISD                                        \
    (uint32_t) (1 << 1) /* USB device endpoint x IN endpoint disabled \
                           interrupt */
#define USB_FS_DIEPINTx_TOC \
    (uint32_t) (1 << 3) /* USB device endpoint x IN timeout condition */
#define USB_FS_DIEPINTx_ITTXFE                                             \
    (uint32_t) (1 << 4) /* USB device endpoint x IN token received when TX \
                           FIFO is empty */
#define USB_FS_DIEPINTx_INEPNE \
    (uint32_t) (1 << 6) /* USB device endpoint x IN endpoint NAK effective */
#define USB_FS_DIEPINTx_TXFE \
    (uint32_t) (1 << 7) /* USB device endpoint x IN TX FIFO empty */

#define USB_FS_DOEPINTx_XFRC                                           \
    (uint32_t) (1 << 0) /* USB device endpoint x OUT transfer complete \
                           interrupt */
#define USB_FS_DOEPINTx_EPDISD                                         \
    (uint32_t) (1 << 1) /* USB device endpoint x OUT endpoint disabled \
                           interrupt */
#define USB_FS_DOEPINTx_STUP \
    (uint32_t) (1 << 3) /* USB device endpoint x OUT SETUP phase complete */
#define USB_FS_DOEPINTx_OTEPDIS                                           \
    (uint32_t) (1 << 4) /* USB device endpoint x OUT token receieved when \
                           endpoint disabled */
#define USB_FS_DOEPINTx_B2BSTUP                                         \
    (uint32_t) (1 << 6) /* USB device endpoint x OUT back-to-back SETUP \
                           packets received */

#define USB_FS_DIEPTSIZ0_XFRSIZ(n) \
    (uint32_t) (n << 0) /* USB device endpoint 0 IN transfer size (7 bits) */
#define USB_FS_DIEPTSIZ0_PKTCNT(n) \
    (uint32_t) (n << 19) /* USB device endpoint 0 IN packet count */

