birdboat00/f9-kernel/include/platform/stm32l4/registers.h
#define USB_FS_DIEPTSIZx_XFRSIZ(n) \
    (uint32_t) (n << 0) /* USB device endpoint x IN transfer size (19 bits) */
#define USB_FS_DIEPTSIZx_PKTCNT(n) \
    (uint32_t) (n << 19) /* USB device endpoint x IN packet count (10 bits) */
#define USB_FS_DIEPTSIZx_MCNT_1 \
    (uint32_t) (1 << 29) /* USB device endpoint x IN multi count 1 */
#define USB_FS_DIEPTSIZx_MCNT_2 \
    (uint32_t) (2 << 29) /* USB device endpoint x IN multi count 1 */
#define USB_FS_DIEPTSIZx_MCNT_3 \
    (uint32_t) (3 << 29) /* USB device endpoint x IN multi count 1 */

#define USB_FS_DOEPTSIZ0_XFRSIZ(n) \
    (uint32_t) (n << 0) /* USB device endpoint 0 OUT transfer size (7 bits) */
#define USB_FS_DOEPTSIZ0_PKTCNT(n) \
    (uint32_t) (n << 19) /* USB device endpoint 0 OUT packet count */
#define USB_FS_DOEPTSIZ0_STUPCNT(n)                                      \
    (uint32_t) (n << 29) /* USB device endpoint 0 OUT back-to-back SETUP \
                            packets allowed */

#define USB_FS_DOEPTSIZx_XFRSIZ(n)                                           \
    (uint32_t) (n << 0) /* USB device endpoint x OUT transfer size (19 bits) \
                         */
#define USB_FS_DOEPTSIZx_PKTCNT(n)                                           \
    (uint32_t) (n << 19) /* USB device endpoint x OUT packet count (10 bits) \
                          */
#define USB_FS_DOEPTSIZx_STUPCNT(n)                                      \
    (uint32_t) (n << 29) /* USB device endpoint x OUT back-to-back SETUP \
                            packets allowed */
#define USB_FS_DOEPTSIZx_RXDPID \
    (uint32_t) (1 << 29 |       \
                1 << 30) /* USB device endpoint x OUT received data PID */

/* Powe and Clock Gating Control Register */
#define USB_FS_PCGCCTL_STPPCLK (uint32_t) (1 << 0)  /* USB stop PHY clock */
#define USB_FS_PCGCCTL_GATEHCLK (uint32_t) (1 << 1) /* USB gate HCLK */
#define USB_FS_PCGCCTL_PHYSUSP (uint32_t) (1 << 4)  /* USB PHY suspended */

#endif
